[
{"name": "Yenching Academy Scholarship in China 2022 (Fully Funded)", "funding_type": "Fully funded", "deadline": "2021-12-03 00:00:00", "description": "Yenching Academy of Peking University is inviting international students worldwide to apply for the \n for the academic year 2022. The scholarship is offered to pursue a \n in China. Scholarships will be awarded on a merit basis, academic excellence, and a record of extracurricular activities. Students can apply from any country; there are no restrictions on nationality; therefore, the students who meet the criteria should apply for this scholarship. This scholarship will help international students get insight into Chinese culture and an opportunity to study in the 16\n best institute in the world.\nYenching academy accepts a large number of international students every year, as for scholarships approx. one hundred and twenty students from Asia and other countries are selected. Therefore, 80% of the enrolled students are international students, among them 30-35% students are from European countries, 25% from America, Canada and almost 30% from the rest of the countries. Students will complete postgraduate studies and have a culture exchange knowledge as students from different countries study together and exchange their cultures and values.\nYenching Academy of Peking University offers master’s degrees in 6 different fields; economics and management, philosophy and religion, law and society, history and archaeology, politics and international relation, and literature and culture. Yenching Academy will provide all the funding for the successful candidates, including tuition fees, research cost, monthly stipend, travel cost, and accommodation. The duration of the Yenching academy scholarship is 2 years for the master’s program.\nDeadline is December 3, 2021", "region": "China", "eligibility": ["Both male and female students are encouraged to apply.", "Applicants must have a bachelor’s degree or must be enrolled in a degree program.", "Applicants must be under the age of 28 at the time of application.", "They must graduate before 31 August 2022.", "Applicants must have an excellent academic record.", "Applicants must be proficient in English language.", "English proficiency test results obtained before September 2020 are not acceptable."], "benefits": ["Full tuition fee,", "Medical insurance,", "Monthly stipend,", "Accommodation,", "Round trip travel allowance."], "other_details": ["CV", "Application form", "Personal statement", "Official transcripts", "Degree certificate/diploma", "Two letters of recommendation", "Certificate of enrollment (if enrolled)", "English language proficiency test certificate"], "apply_link": "https://yenchingacademy.pku.edu.cn/ADMISSIONS.htm"},
{"name": "MIPLC DAAD Scholarship in Germany 2022 (Fully Funded)", "funding_type": "Fully funded", "deadline": "2021-10-15 00:00:00", "description": "MIPLC DAAD scholarship is open for 2022. MIPLC is a part of the DAAD postgraduate program scholarship, specifically for the \n. The scholarship is fully funded for students who want to attain a postgraduate law degree from Europe and belong to developing countries. Outstanding graduates with excellent academic performance and achievements are encouraged to apply for this scholarship and influence their community.\nStudents will get an opportunity to experience study IP and competitive law at one of the top institute in Europe. Students of different ethnicities and nationalities will gather from different countries and exchange cultures. Students who cannot afford to study LLM outside their countries without financial assistance and demonstrate academic excellence will be preferred. It is an excellent opportunity to interact with top law professors, so do not miss out on this opportunity to study law in Europe.\nThe program is a joint project of top institutes of Europe and the United States of America, including Max Planck Institute, Technical University of Munich, Augsburg University, and Church Washington University. MIPLC DAAD scholarship is fully funded, while the MIPLC waiver scholarship is partially funded. Further details are provided in the following article.\nDeadline is October 15, 2021", "region": "Germany", "eligibility": ["In addition, applicants must belong to one of the developing countries.", "Applicants must be living in their home countries; applicants living outside the Home Counties for more than two years are not eligible.", "They must have obtained a four years bachelor’s degree.", "Suppose an applicant’s degree bachelor’s degree is three years. In that case, they must have one year of another degree to complete credit hours as of 4 years bachelor’s program or must have professional experience.", "They must have obtained a bachelor’s degree within the last 5 years, no more than six years at the time of application.", "Applicants must have 2 years of professional experience.", "Applicants must meet the admission criteria of MIPLC (Munich Intellectual Property Law Center).", "Applicants should be proficient in the English language."], "benefits": ["Full tuition fee of the program.", "850 Euro as a monthly stipend.", "Health and liability insurance for the duration of the scholarship program.", "Cost of travelling from home country (if the travel is not funded by Home County).", "Research allowance.", "Free of cost German language course."], "other_details": ["Signed application form", "Signed CV", "Letter of motivation signed", "2 letters of recommendation (one professional and one academic)", "Diploma/degree certificate", "Transcript (and grading scale)", "Ranking information", "School leaving certificate", "Grade conversion sheet", "Professional experience proof", "English test", "Application fee and proof of payment", "Photos", "Signed financial assistance application form", "Signed statement on the economic situation", "Supporting documents", "Signed DAAD application form"], "apply_link": "https://www.miplc.de/llm-ip/admissions/daad-scholarship/"},
{"name": "MEXT APU Japanese Government Scholarship 2022", "funding_type": "Fully funded", "deadline": "2021-11-17 00:00:00", "description": "Applications are open for the \n for the academic year 2022. The Japanese government scholarship 2022 includes \n for international students. It is a fully-funded opportunity for international students to study from the top international private institution of Japan, the scholarship will cover full tuition fee, provide stipend and travel expense to lessen the student’s burden. The scholarship is offered at the Asia Pacific University in Japan.\nBrilliant and outstanding students will be a part of this program after going through the selection process. The aim is to enhance international competitiveness and promote the exchange of students. The scholarship is open to all programs offered by Asia Pacific University for all levels of fields. The scholarship can be accessed online. Avail this opportunity before the deadline and get a degree from the prestigious University of Japan. Further details are mentioned in the article below.\n \nDeadline is November 17, 2021", "region": "Japan", "eligibility": ["Applicant must have studied at a university where the mean of communication is English.", "Applicant must intend to study in Japan from overseas.", "Must not be a Japanese national or belong to a country that has diplomatic relations with Japan.", "Must be born in the year 1985 or after.", "Applicant must either meet the English language proficiency criteria or the Japanese language proficiency.", "English proficiency test score must be equivalent to B2 or above on the common European framework of reference for languages (e.g., TOEFL IBT 72 or above, IELTS 5.5 or above).", "Students can not apply for more than one scholarship.", "Selected candidates can not receive any other scholarships."], "benefits": ["The host institute will cover a 100% tuition fee.", "In addition, 144,000 JYP will be given per month for the living expenses.", "Economy class air travel from home country to Japan at the beginning and end of the program."], "other_details": ["Applicants who are serving on active military duty or by the military at the time of application are not eligible for Japanese government scholarship.", "Students must be able to arrive in Japan during the arrival period stipulated by APU.", "Those who apply for this scholarship must not have received a scholarship in the past; unless they have more than 3 years of research experience after the previous MEXT scholarship award.", "Recipients of this scholarship must have a student status of residence (visa status) in Japan."], "apply_link": "https://admissions.apu.ac.jp/graduate/how_to_apply/external_scholarship/u_recommendation/#item_2"},
{"name": "Kochi University of Technology Special Scholarship Program 2022", "funding_type": "Fully funded", "deadline": "2021-09-17 00:00:00", "description": "The application for the special scholarship program (SSP) is open now. The program is offered to doctoral and project-based candidates. The applicants must submit their online requests to the project leader before submitting their research proposal.\nThe form can be downloaded via the official website (link is provided below). It is a three-year program, and the scholarship will be provided for one year. After that, the scholarship will be extended each year unless the university terminated the student for any of the reasons. Not more than three students will be enrolled for each project leader.\nOnly applicants who obtain the leader’s permission for their preferred project are eligible to apply with documentation. The admission decision will be made after examining the documents and the results of an interview, English exam, and academic achievement exam in the field of specialization required to conduct the selected research project.\nDeadline is September 17, 2021", "region": "Japan", "eligibility": ["Applicant must have perm from the lease of preferred SSP project to apply for this program.", "Hold a degree of recognized institute equipment to master’s degree of KUT after 18 years of education. Alternatively, the applicant is scheduled to acquire a master’s degree before KUT enrolment.", "Applicant must be under the age of 35.", "Must have an excellent academic record with degrees from reputable universities.", "Applicant must possess intention, knowledge, and research skill for this program.", "Applicants must be proficient in English.", "Special scholarship program candidates must work a minimum of 50 hours monthly for a specific research project at Kochi University.", "Candidates must report his/her study and research achievements to the dean of the Graduate School of Engineering by the end of each semester. The submitted report will be evaluated by the dean of the Graduate School of Engineering."], "benefits": ["30,000 yen entrance examination fee will be exempted.", "300,000 yen enrolment fee and 536,800 yen tuition fee will be exempted.", "150,000 yen will be provided each month for living expenses and research projects (taxes must be paid from this amount).", "150,000 yen will be provided for travel costs (only to international applicants living outside Japan).", "The program will be conducted in the English language."], "other_details": [], "apply_link": "https://www.kochi-tech.ac.jp/english/admission/ssp_aft19oct/ssp_application_guideline.html"},
{"name": "Habib Oil Trainee Program 2021", "funding_type": "Fully funded", "deadline": "2021-09-15 00:00:00", "description": "Applications are open for the Habib Oil trainee program for graduates. The applications are open till September 15\n. This program is open to Pakistani students for the year 2021. Both male and female graduates can avail this opportunity who are under the age of 25. This will be a paid program. The commencement of the program will be from October 2021.\nThe duration of the program is one year, which means you can learn, grow and earn for a whole year. In addition, this program does not require any prior experience from students. This makes the fresh graduates eligible for this program. It is an excellent opportunity to begin earning right after your undergraduate degree.\nThe training will be held in Karachi. This program aims to train young minds to learn leadership and workplace skills. This will enhance students for their future careers. Send your résumé to the email provided in the article without wasting any more time. Avail this golden opportunity and explore your inner talents. Further details are provided in the article below.\nDeadline is September 15, 2021", "region": "Karachi Pakistan", "eligibility": ["Applicant must be under the age of 25.", "Applicant must hold a bachelor’s degree.", "Applicants must be good at critical thinking.", "Applicant must have secured a minimum of 3GPA in bachelor’s degree.", "Fresh graduates can apply as no experience is required.", "Applicants must be good at teamwork.", "Must possess good communication skills.", "Applicants must attend the training program in Karachi; no other city will be holding the training program."], "benefits": ["Applicants will receive a monthly stipend.", "Habib oil trainee program will be a kickstart to your career.", "Working under supervision will develop skills and enhance your learnings."], "other_details": ["Finance", "Commerce", "Costing", "Accounting", "Internal Audit", "Other Relevant to Finance", "Electronic engineering", "Electrical engineering", "Mechanical engineering", "Chemical engineering", "Other Relevant to Engineering", "Sales", "Marketing", "Other Relevant to Marketing", "Human Resources", "Management Sciences", "Public Administration", "Other Related to HR", "Business Administration"], "apply_link": "http://hom.com.pk/group/"},
{"name": "Chevening Scholarship 2022 (Fully Funded)", "funding_type": "Fully funded", "deadline": "2021-11-02 00:00:00", "description": "Applications are now open for the world’s most prestigious scholarship \nChevening is UK’s top scholarship that provides a one-year master’s program opportunity in the UK universities to all the aspiring candidates from Chevening member countries. The Chevening Scholarship program is a golden opportunity for outstanding, talented and skilled students who want to excel in careers and achieve their goals while studying and getting trained from a world-class educational institution in which they were not able to study otherwise. The scholarship is offered for those students who have a great aspiration about learning various cultures, are resilient, and welcoming towards others.\nChevening Scholarship allows outstanding emerging leaders from around the world to obtain a one-year master’s degree in the United Kingdom. While there is no “typical” Chevening Scholar, we are looking for the kind of people who have the passion, ideas and influence to provide the solutions and leadership necessary to create a better future. Their actual journey will start after they complete and commit to serve their communities after returning back to their home countries. This scholarship gathers outstanding scholars and potential leaders from over 160 countries and territories which creates networks, builds friendships and memories.\nBecause these scholarships are fully funded (flight, accommodation and course fees are included), you can focus on achieving your professional goals and maximizing your life experience. He will live and study in the United Kingdom for a year, during which time he will develop professionally and academically, interact widely, experience the culture of the United Kingdom and build lasting positive relationships with the United Kingdom. Upon completing your studies, you will leave the United Kingdom equipped with the knowledge and networks necessary to realize your own ideas.\nDeadline is November 2, 2021", "region": "United kingdom", "eligibility": ["Be a citizen of a country or territory eligible for Chevening.", "Return to your country of citizenship for a minimum of two years after your concession ends.", "Having completed all the components of a university degree that allows you to enter a postgraduate. program at a university in the United Kingdom when you apply. This is usually equivalent to a 2: 1 second-class honors degree in the United Kingdom.", "Have at least two years of work experience.", "Apply for three eligible UK university courses and have received an unconditional offer of one of these options.", "Comply with the requirements of the Chevening English language.", "Have dual British or British citizenship (unless you are a citizen of a British Overseas Territory or have BN (O) and submit your application from Hong Kong).", "Have refugee status in an ineligible Chevening country. Applicants who are citizens of a country eligible for Chevening and who have refugee status in a country eligible for Chevening are eligible for a scholarship.", "Is an employee, a former employee or relative * of an employee (since July 2018) of His Majesty’s Government (including British embassies / high commissions; Department of International Development; Department of Business, Energy and Industrial Strategy; Department of International Trade Affairs; the Ministry of Defense; and the Ministry of Interior), or a staff member of the Commonwealth University Association.", "Employees, former employees or relatives * of an employee (since July 2018) of Chevening Partner organizations are eligible to submit an application, but cannot receive a Chevening Partner Award from the organization from which they work, worked previously or are affiliated through relatives.", "Having previously studied in the United Kingdom with funds from a grant funded by the United Kingdom government.", "\n", "\n"], "benefits": ["Full University Enrollment", "A monthly stipend will be provided for candidate extensions", "Travel tickets", "Arrival Subsidy", "Return Departure Permit", "Visa application cost", "Chevening will pay the quarantine cost of candidates (if required).", "COVID vaccination for free (if applicable).", "Travelling scholarships to attend Chevening events in the United Kingdom."], "other_details": ["Pearson PTE Academic", "TOEFL iBT", "IELTS Academic", "C1 Advanced (formerly Cambridge English: Advanced [CAE])", "\nTrinidad ISE II (B2)", "All applicants must demonstrate that they have met the English language requirement of Chevening.", "Full-time employment", "Part-time employment", "Voluntary work", "Paid or unpaid internships"], "apply_link": "https://www.chevening.org/"},
{"name": "Fully Funded IBM Z Day Conference 2021 (Virtual Conference)", "funding_type": "Fully funded", "deadline": "2021-09-14 00:00:00", "description": "Opportunities circle is here with another opportunity for the youth! IBM is offering “IBM Z Day Conference” on Enterprise computing. It is a one-day free online conference where skilled professionals will highlight industry and innovation trends and demonstrate how IBM works in today’s world and its important role.\nThe event comprises a 1-day virtual conference where more than 100 industry expert speakers will address and highlights modern-day innovation and trends and 24 hours of the global student meet-up. In addition, IBM provides a learning platform for all students and professionals. The sessions include IBM keynotes, keys to crypto resiliency, classical cryptography and the impact of quantum computing, addressing cyber threats by developing multi-factor authentication at scale, mainframe survey (a sneak peek), AI and IBM Z skills, many other informative sessions for students and life-long learners. Female students are also encouraged to register for the free conference.\nAttendees of the conference will also know how open source technologies are being used for IBM z/OS and Linux. Students and other learners will come together virtually from all around the world to advance their skills and learn the challenges of 2021 from experts and professionals. Do not worry; there are no registration charges; you can register for the conference for free.\nIBM will help the UN to feed two poor children for every student who registers. In addition, IBM will donate towards UN World Food Programme to fight and tackle hunger. So register for the free conference and share it with your friends and colleagues, help yourself and help others.\nDeadline is September 14, 2021", "region": "Online", "eligibility": ["Students, youth, and young professionals of relevant backgrounds can apply.", "There are no restrictions on age; anyone can apply for the free conference.", "People from all countries are eligible to apply.", "Attendees must have a good internet connection to attend the conference without any disruption."], "benefits": ["Free one-day open conference.", "No registration charges.", "Get a chance at a global student meet-up.", "Free sessions from IBM expert speakers.", "Free global student meet-up.", "Opportunity to learn from the professionals of one of the top and largest multinational technology corporations.", "Pave a path to a successful future."], "other_details": [], "apply_link": "https://ibm.biz/opportunities-circle"},
{"name": "CM Punjab Internship Program 2021 (Paid Internship)", "funding_type": "Paid", "deadline": "2021-09-12 00:00:00", "description": "The government of Punjab is offering \n for graduates of media studies. The applications for the CM Punjab Internship Program 2021 are now open till 12 September 2021. Usman Buszdar, the Chief Minister of Punjab has announced this program. This program aims to sharpen and enhance the skills of the youth of Pakistan. The Punjab government seeks hardworking, promising, passionate, skilled, and motivated media students who are currently searching for jobs.\nInterns will easily get government jobs after this program, as it is also a government internship. The candidates will receive a stipend as well. There are approximately \n for this program this year. Both male and female graduates from any city of Pakistan can avail this opportunity. Young and fresh minds of Pakistan are encouraged to apply for this golden opportunity.\nThe internship will be conducted in the following areas of Lahore; Mahmoud Ghaznavi road, Abbott road, Usmania Colony, Ghari Shahu. Applicants will only be allocated in these areas of Punjab. Further details are provided below.\nDeadline is September 12, 2021", "region": "Lahore Pakistan", "eligibility": ["Applicants can be from any city in Pakistan.", "Both male and female graduates are eligible.", "Applicants must hold a graduate degree in media studies from an HEC recognized institute.", "Applicants must be between the age of 18 to 25.", "Fresh graduates are eligible as no previous experience is required."], "benefits": ["Fresh graduates can start earning.", "Interns will receive a stipend of PKR 20,000.", "Five hundred vacancies are available, so the chances of being selected are relatively high to other internship programs."], "other_details": [], "apply_link": "https://dgpr.punjab.gov.pk/"},
{"name": "TU Graz Scholarship in Austria 2022, Fully Funded", "funding_type": "Fully funded", "deadline": "2021-12-01 00:00:00", "description": "Applications are open for TU Graz Scholarship for the academic year 2022. The scholarship is available for Slovenia, Croatia, Bosnia, Serbia, Montenegro, Macedonia, and Herzegovina students. This scholarship aims to promote the advancement of education in underdeveloped countries and offer international standard education and training and facilitate international students by providing training and internships.\nThis scholarship is offered in cooperation with the University of Graz with the University of Music and Performing Arts and TU Graz and Steimaekische Sparkasse. The duration of this scholarship program is 12 months that includes a scholarship for a 2-semester program and a training program for two months, and a German course.", "region": "Austria", "eligibility": ["Applicants must be under the age of 27.", "They must be from the eligible countries (the list is mentioned above).", "Applicants must have completed four semesters of their bachelor’s program.", "Doctoral students must submit a letter of confirmation from the supervisor.", "They must have an excellent academic record.", "They must have strong communication skills, dedication, and adaptability to solve practical and analytical problems."], "benefits": ["A monthly stipend of 750 Euro", "TU Graz university tuition fees", "Social and cultural events."], "other_details": ["Confirmation of enrollment from home university", "Personal statement", "Transcripts", "Diploma/degree certificate", "2 letters of recommendation", "CV", "Copy of passport", "English language proficiency"], "apply_link": "https://www.tugraz.at/en/studying-and-teaching/international-studying-and-teaching/exchange-at-tu-graz/mobility-programmes/best-of-south-east/"},
{"name": "King Fahad University Scholarship 2022, Fully Funded", "funding_type": "Fully funded", "deadline": "2021-09-21 00:00:00", "description": "Applications are open for the King Fahad University Scholarship for the academic year 2022.\nOpportunities circle brings another opportunity for graduate students to study in Saudi Arabia. The King Fahad University of Saudi Arabia is offering fully funded scholarships to pursue \n. Students with the potential to conduct researches in science, engineering, and business can apply for this scholarship. King Fahad University is known for conducting quality research projects; they make the students capable of turning an innovative idea into something beneficial.\nKing Fahad University hosts students from 28 different countries each year. National, as well as international students, are encouraged to apply. The University will be responsible to cover all the expenses of successful candidates. King Fahad University of Petroleum and Minerals is a public institute located in Dhahran. It is mostly recognized for its business, science, and engineering programs in the whole country.\nAccording to the QS world ranking of universities, King Fahad University is in the list of the top 200 best universities globally, and it is the 3\n best University of Saudi Arabia.\n \nDeadline is September 21, 2021", "region": "Saudi Arabia", "eligibility": ["The applicant must hold a Bachelor’s degree in science or engineering for a Master’s program.", "An applicant must have a GPA of 3.0 out of 4.00 to be eligible to apply.", "The applicant must show the ILETS or TOEFL certificate.", "The student must have undertaken GRE.", "Lastly, they should submit a letter of recommendation from the University’s faculty."], "benefits": ["The scholarship will cover the full tuition fee.", "A monthly stipend.", "Free accommodation.", "Basic medical care.", "Subsidized meals in the University cafeteria.", "Project Funding.", "Return ticket (once)."], "other_details": ["CV", "GRE", "IELTS/TOEFL", "Degree certificate", "Complete transcripts", "Statement of purpose", "Scanned passport of international students."], "apply_link": "http://www.kfupm.edu.sa/deanships/dgs/Pages/en/Full-MS-PhD-Scholarships-Opportunity.aspx#"},
{"name": "World Bank Legal Internship Program 2022", "funding_type": null, "deadline": "2021-09-30 00:00:00", "description": "Applications are open for the \n 2022. It is a competitive internship that aims to attract efficient law students from around the world. This program will allow the students to grow and enhance their skills from a multinational organization. To the law community, this internship is known as the World Bank Legal Vice Presidency.\nThe World Bank aims to provide initial experience and exposure to the interns about the practical work. The interns will be working as a team under the supervision of professional staff. This opportunity helps young students step into the world of practice. The interns will get to work on high-profile cases and can share their ideas and viewers regarding it. The interns will be permitted to engage in corporate, finance, administration, and other constitutional matters. This opportunity will make the interns noteworthy in the future. Therefore, apply for this program before the deadline. Further details are mentioned below.\nDeadline is September 30, 2021", "region": "USA", "eligibility": ["The applicant must hold citizenship of any IBRO member state.", "Applicants must be enrolled in a law degree (LLB, JD, LLM, SJD, PhD, or equivalent degree).", "Must have proof of an internationally recognized insurance policy.", "The university or other funding organizations must reward the applicant in agreement with World Bank policies.", "Applicants who can speak any second language that is the working language of the World Bank will be preferred (Arabic, Chinese, French, Russian or Spanish).", "Both the national and international students are eligible."], "benefits": ["Will get to participate in high-profile events and conferences.", "Interns will practice law with the world’s best professionals of the legal vice president.", "Will have three months of internship while being a student of law in their law school or university.", "Interns can be working at the headquarters of World Bank in Washington DC.", "Students will get three opportunities for an internship at the world bank in a year (summer internship, fall internship, winter internship, and spring internship).", "The world bank will provide Visa assistance to the interns under special circumstances."], "other_details": [], "apply_link": "https://www.worldbank.org/en/about/careers/programs-and-internships/Legal-Internship-Program"},
{"name": "MSU International Scholarships 2022, USA", "funding_type": "Partial Funded", "deadline": "2021-11-01 00:00:00", "description": "Applications for MSU international Scholarships are open now. Michigan State University is offering numerous scholarships for international students. International students from all around the globe are encouraged to apply. The applications are open for batch 2022.\nThe presidential study abroad scholarship award must be used during the first of eight semesters of an undergraduate degree at MSU or before the undergraduate degree is completed. YouAreWelcomeHere undergraduate scholarship will be awarded to a selected group of international undergraduate students who show dedication to spreading the #YouAreWelcomeHere message by overcoming intercultural differences. This scholarship is awarded to incoming students with non-U.S. residency status applying from outside the country. On the other hand, international tuition grants is merit scholarship is based on academic performance, extracurricular activity, essays, and regional diversity.\nInternational students aiming for an undergraduate degree can apply for any of the MSU international scholarships. This is a great chance to study in the United States. Some of the MSU international scholarships will most of the academic expenses (tuition fees) of the undergraduate studies at Michigan State University. Students will be selected based on their previous academic records. However, do not miss the chance to study at United States’ well-known research university. The university has served as a model for land-grant colleges and universities.\nDeadline is November 1, 2021", "region": "USA", "eligibility": ["Candidates must be international students (some scholarships are open for U.S. nationals, check furthers details in the article).", "Brilliant, talented, and motivated students with the outstanding academic record will automatically be considered for the scholarship.", "Students must be applying for the undergraduate degree program at Michigan State University.", "They must meet the admission criteria and apply for admission."], "benefits": ["This scholarship will be awarded to a few academically brilliant and excellent individuals. The grant value is US$7,000 per year; for all 8 semesters of the undergraduate program.", "The Non-resident Honours College invites U.S. citizens or permanent residents, nationals of Canada or Mexico, offering US$5,000 each semester for a total of eight semesters.", "It is paid a stipend of about the U.S. $3,500 annually for working 8-10 hours weekly on faculty-mentored research or scholarly activity, which is renewable for four semesters.", "The award value is $3,000 up to $5,000, depending on the program duration.", "US $25,000 will be awarded for tuition fees each year and can be renewed each semester for eight semesters.", "The Grants range from $15,000 to US$25,000 per semester for a total of eight semesters."], "other_details": [], "apply_link": "https://admissions.msu.edu/cost-aid/scholarships/international"},
{"name": "The Commonwealth Youth Awards 2021", "funding_type": "Fully funded", "deadline": "2021-10-17 00:00:00", "description": "Are you working for the betterment of the community under SDG goals? Then, apply for the Commonwealth Youth Awards 2021. The awards are open for the youth of commonwealth countries working for sustainable development and creating an impact in their communities. If you are working on any of the 17 sustainable development goals, including no poverty, zero hunger, good health and well-being, quality education, gender equality, clean water and sanitation, affordable and clean energy, or other goals, go ahead and nominate today.\nYoung people aged 19 to 29 years can apply for this award. Candidates will be selected, and awards will be given based on the level of impact they created, level of innovation, achievements, quality of evidence, and sustainability. Four finalists will be selected from each region for the award.\nThe award’s objective is to highlight the efforts of youth towards development and create an environment to sustain investment in youth-led development. In addition, Commonwealth aims to motivate and encourage the rest of the challenging young people to make efforts and set standards for their work.\nDeadline is October 17, 2021", "region": null, "eligibility": ["Nominees must be 18 to 29 years.", "They must be the founder or a co-founder of the social enterprise.", "Finally, they must belong to one of the commonwealth countries (the list is provided in this article)."], "benefits": ["4 finalists will be selected to receive the regional winner award.", "Twenty regional finalists will receive a grant of £1,000, a certificate and a trophy.", "Five regional winners will be selected and awarded £3,000, a certificate and a trophy.", "The pan commonwealth winner will receive £5,000 with a trophy.", "Many coaching and development opportunities will also be provided to the winners."], "other_details": ["Be engaged in development work for more than 12 months (one year), either voluntary or professionally.", "Be a Commonwealth citizen, and must be working in a member country.", "Must be under the age of 29 on 31 December 2021.", "Candidates can nominate themselves; people who know and can describe their work can also nominate them."], "apply_link": "https://commonwealth-youthexcellence.awardsplatform.com/"},
{"name": "Nanyang Assistant Professorship (NAP) 2022, Singapore", "funding_type": "Fully funded", "deadline": "2021-09-30 00:00:00", "description": "The Nanyang Assistant Professorship (NAP) 2022 is open for applications. It is known as one of the world’s top scholarships as its offers are exceptional. This is a chance for fresh researchers to start their careers at top-ranked universities. The NAP promises to make you the next promising Scholar.\nThe brilliant and motivated individuals are encouraged to avail this opportunity. Selection will be free from discrimination. There is equal opportunity for males and females in this program from every discipline.\nNAP aims to empower young researchers and scholars. The scholars are permitted to do their research projects according to their own lead while serving NTU. The candidates must serve NTU for one year as assistant professors. They will be having access to new technology and a top-class educational system. More information is discussed in detail below.\nDeadline is September 30, 2021", "region": "Singapore", "eligibility": ["The applicant must be a fresh researcher or a postdoctoral fellow or equivalent from a recognized university.", "Applicant must have a doctorate or equivalent degree (within the past 10 years).", "Must have a record of publications.", "Must have relevant teaching experience.", "The applicant must be able to lead their research group independently.", "Clinical scientists are eligible to apply.", "Applicants must not be existing NTU family members."], "benefits": ["The assistant professors will receive a start-up research grant (up to 1 million Singaporean Dollars).", "Professors will be provided accommodation.", "Remuneration costs will be covered.", "Professors will get a tenure track appointment from the university.", "Access to extraordinary and advanced research laboratories will be permitted.", "Grants will be provided for multiple research projects."], "other_details": ["Cover letter", "Research proposal", "Updated CV with full publication list", "There referee reports"], "apply_link": "https://www.ntu.edu.sg/research/research-careers/nanyang-assistant-professorship-(nap)#Content_C002_Col00"},
{"name": "Boise International Scholarships 2022 in USA", "funding_type": "Partial Funded", "deadline": "2021-12-15 00:00:00", "description": "Applications are open for the Boise International scholarships for international students to pursue undergraduate programs in the United States. Boise State University offers different scholarships that offers differnt benefits for international students who want to pursue undergraduate studies in the USA. There are two offers of scholarship, automatic scholarship and application scholarship. The automatic scholarships include different scholarships. The application scholarship requires an additional application.\nThe distinction and Excellence awards are opportunities for undergraduate international students. Both the scholarships are available for first-year undergraduate and transfer applicants. Boise state university (BSU) is a known public research university in Idaho, founded in 1932 by the Episcopal Church. It became an independent junior college in 1934.\nIf an applicant fills the undergraduate scholarship criteria, then he/she will most likely receive the award for their degree. The award will be granted for the entire program (8 semesters) if the student successfully maintains the required GPA. More details for the scholarships are mentioned below.\n \nDeadline is December 15, 2021", "region": "USA", "eligibility": ["Applicant must be seeking the Boise State University undergraduate degree for the first time.", "For a Global distinction scholarship applicant must secure a 3.00 GPA.", "For Global excellence scholarships, applicants must secure a 3.50 GPA.", "Radiology, pre-radiology, and other self-supported online program students are ineligible for this scholarship.", "Students receiving other scholarships are ineligible for Global excellence scholarships.", "Applicant must demonstrate ambitious professional or academic goals committed to bringing positive change in the Boise State community."], "benefits": ["Students will receive scholarships worth up to $16,920 per academic year for the Global Excellence scholarship.", "Global Distinction scholarship students will receive up to $8,460 per academic year.", "Students will get to study in the United States."], "other_details": [], "apply_link": "https://www.boisestate.edu/"},
{"name": "Found work Artist Prize 2021", "funding_type": "Fully funded", "deadline": "2021-11-30 00:00:00", "description": "The Found work Artist Prize 2021 will begin in October this year. The Found work Artist Prize is a competition introduced in 2019 to recognize outstanding Artwork by artists. A jury selects the honorees after a thorough examination of the art.\nThe competition is open for artists working in any media. The honourees selection process will take place in the fall. Two honorees will receive $10,000 and studio visits.\nDeadline is November 30, 2021", "region": null, "eligibility": ["The Found work Artist Prize is open to artists from any part of the world", "Artists working in any media are eligible", "Artist must be an individual who is at least 18 years old", "Applicant must be able to enter any binding contract", "Found work employees are ineligible", "Found work contractor or Found work employee relatives are also ineligible for this award.", "Applicant must be able to use Found work and participate in the competition under all the applicable laws, rules, and regulations.", "Applicant must have a published artist profile on Found work, with a minimum of 6 published artworks, from October 10", ", 2021 to November 30", ", 2021."], "benefits": ["Found work Artist Prize selects two deserving artists for the award. Both of them will receive a $10,000 grant and studio visits with each of this year’s distinguished juniors.", "The winners and three shortlisted artists will be invited for interviews as part of the dialogue program."], "other_details": ["Artwork in any media is acceptable for the award. However, note that the Artwork reviewed for the prize must be created by you individually(must not be attributed to any other person).", "The first 6 Artworks that a participant displays at the top of their profile on Found work will be considered for the award.", "An artist is permitted to publish more than 6 works on their profile. The jury may review any additional work at your or the jury’s consideration."], "apply_link": "https://foundwork.art/artist-prize"},
{"name": "Ireland Government Scholarship Programme 2022", "funding_type": "Fully funded", "deadline": "2021-10-21 00:00:00", "description": "Opportunity for students who want to pursue education in Ireland. \n is offered for international students for 2022. The scholarship is offered for postgraduate programs (master’s and PhD programs) as a national initiative by the Department of Higher Education, Research, Innovation, and Science. The government of Ireland provides equal opportunities for students from all nationalities regardless of gender, race, or ethnicity. The program is offered to highly talented students who are interested in research for development and postgraduate studies. Individuals will be given prestigious awards for outstanding research in different disciplines.\nApplicants with proposals for research in emerging fields that introduce creative innovation are highly encouraged to apply. The scholarship is highly competitive, with a success rate of only 18% over the past five years. Individuals who will be successful in securing scholarship funding will be recognized as potential world-class research leaders of the future. Different departments and agencies of government are funding this scholarship that includes environment protection agency, department of foreign affairs, department of children, equality, disability, integration, and youth.\nApplicants can apply for the scholarship to pursue full-time masters and PhD programs to study in Ireland. They will get a chance to study and conduct research in top institutes and universities of Ireland. So don’t waste the time and start preparing for your application today!\nDeadline is October 21, 2021", "region": "Ireland", "eligibility": ["There is no age limit for applicants.", "Applicants must carefully check if they are eligible before applying for the program and scholarship.", "Applicants must pass the eligibility quiz on the application system before accessing the application form.", "Applicants must be affiliated with eligible higher education institutes or research-performing organizations.", "Irish research council will not award scholarship for prohibited areas, including human cloning for reproductive purposes, production of human embryos for stem cell procurement (including by means of somatic cells) and genetic modification with heritable changes in human beings.", "Applications must be submitted in the Irish or English language.", "Supervisors and referees must provide a positive report about the applicant.", "Applicants who failed twice after applying for the Ireland government scholarship cannot apply for the same program.", "Students awaiting results may also apply, but they have to provide a provisional certificate from their home institute/university.", "Applicants must not have availed Irish research council scholarship previously."], "benefits": ["€18,500 per annum as a stipend,", "Contribution towards fees that includes non-EU fees up to €5,750 annually,", "Research expenses of €3,250,", "Opportunity to study in one of the top and leading universities in Ireland."], "other_details": ["Statement of Purpose", "Research Proposal", "Supervision details", "Language proficiency", "Additional documents (if required)", "Educational documents", "Copy of passport", "Recommendation"], "apply_link": "https://research.ie/funding/goipg/"},
{"name": "Boston University Postdoctoral Fellowship 2022, USA", "funding_type": "Paid", "deadline": "2021-09-30 00:00:00", "description": "Applications are open for Boston University \n. The Boston lab pulmonary center is conducting a fellowship program for research projects on molecular immunology of infections while focusing on protein Biochemistry. They seek a highly motivated and talented postdoctoral fellow with a brilliant career-building potential to conduct experiments and translational research.\nBoston University is a prestigious private research university of Massachusetts. It currently has more than 3,900 faculty members and nearly 33,000 students. Undergraduate, postgraduate, doctoral degrees are offered at Boston University. These degrees are offered in fields of business, medical, law, and dentistry.\nThe interested candidates are expected to expand the current spectrum of professionalism in a multidisciplinary team of Boston University. The particular areas of the research and study will be the dole and structure of novel Genes involved in inflammation, pathogen recognition, host-pathogen relation, cytokines, macrophages, neutrophils, and related pathways. Pathogens of study are S. pneumoniae, Legionella spp., E. coli, N. brasiliensis, SARS-CoV-2, Influenza, and others.\nThis program will be structured in a way that would meet the qualifications and interests of the applicant. This means the nature of protein Biochemistry, molecular biology techniques, immunology methods, bioinformatics, or surgical mouse models can be discussed with the applicant.\nThe projects will include a broad spectrum of immunology and biochemistry methods together with opportunities for transcriptomic (scRNA-Seq, TOTAL-Seq) and (phospho-) proteomics, including data analysis supported by Bio-informaticians. Another area of interest are genome editing by RNA-guided nucleases (CRISPR-Cas9) for genome-wide screens.\nDeadline is September 30, 2021", "region": "USA", "eligibility": ["The applicant can be from any country.", "The applicant can be a fresh graduate or experienced research with a strong history of publications.", "Applicant must have an MD, PhD, or equivalent degree in a relevant field.", "Applicants must have the skill of initiating, conducting, evaluating, and reporting a research study.", "The applicant who has a strong background in immunology, protein Biochemistry and/or Molecular biology will be preferred.", "Applicants with prior experience in protein structure analysis, monoclonal antibody production, protein-protein interactions, recombinant protein production, and protein mutagenesis will be preferred."], "benefits": ["The Boston University Postdoctoral Fellowship will provide an opportunity in designing and conducting independent research projects.", "Boston University provides a competitive salary to the full-time fellows."], "other_details": [], "apply_link": "https://bu.silkroad.com/epostings/index.cfm?fuseaction=app.jobInfo&version=1&jobid=307789&jobboardid=101"},
{"name": "Laurentian University Graduate Teaching Assistantship 2021", "funding_type": "Partial Funded", "deadline": "2021-09-30 00:00:00", "description": "Laurentian University is offering a Graduate teaching assistantship. The program is open for both full-time international and domestic students who qualify and meet the criteria. There is no separate application. Applicants meeting the minimum average that is 75% will automatically be considered for GTA. This program is partial employment and partial fellowship. Candidates are required to work up to 10 hours a week in teaching assistance.\nGTA will be offered to students enrolled as full-time students in the graduate master program or four years of the PhD program. Applicants must have an offer for admission, and they must register for courses in fall and winter terms (both). Salary will be paid on a bi-weekly basis, while fellowship amount will be paid in one instalment.\nDeadline is September 30, 2021", "region": "Canada", "eligibility": ["Applicants can be enrolled for any subject/course.", "They must be registered as full-time masters or PhD students at Laurentian University.", "They must meet the minimum average that is 75%."], "benefits": ["Laurentian University will provide $9,180 for master students that includes $4,484 as a teaching assistance salary that will be paid bi-weekly; the rest $4,496 will be paid directly to the student’s university account as one instalment.", "$13,307 will be awarded for PhD candidates. $6,651 will be paid bi-weekly as assistance salary; the rest is payable in one instalment for fellowship."], "other_details": [], "apply_link": "https://laurentian.ca/faculty/graduate-studies/graduate-teaching-assistantshipfellowship"},
{"name": "University of the Pacific Scholarships in the USA, 2022", "funding_type": "Partial Funded", "deadline": "2021-12-01 00:00:00", "description": "Applications are open for the \n in the USA. The scholarships are offered for the academic year 2022. The scholarships are offered for international students to pursue \n; the University of the Pacific also awards different scholarships for international transfer students to continue their higher studies in the USA.\nDifferent scholarships are offered for different international students with different funding; scholarships include Powell scholarship, academic merit scholarship, international student merit scholarship, and athletic scholarships. Scholarships can be renewed if the students maintain the required academic performance. The funding amount of scholarships can only be used towards the tuition fee of a full-time program. Many programs are offered under the University of the Pacific scholarships.\nThe University of the Pacific is a private institute with campuses in Stockton, California, San Francisco, and Sacramento. It ranks #133 in the national universities ranking. The university welcomes international students from all around the world regardless of race, gender, and nationality. The University of Pacific offers many disciplines, including Business Management, Marketing, Biological Science and biomedical science, Engineering, and many other related programs.\nDeadline is December 1, 2021", "region": "USA", "eligibility": ["Applicants must have a minimum of 3.7 GPA for the Powell scholarship.", "They must have the potential for leadership.", "For academic excellence scholarship, applicants must have secured a minimum GPA of 3.20 to 3.54.", "For international academic merit scholarship, applicants must have graduated from high school outside the United States of America.", "Applicants must have an excellent academic record they must demonstrate leadership potential.", "Applicants must submit all the required documents before the deadline."], "benefits": ["Powell scholarship will provide $43,000 for first-year international students. Scholars may receive more funding for research opportunities.", "International student merit scholarship awards $15,000 for the first-year international students; the scholarship is also applicable for international transfer students who studied from high school outside the USA.", "Athletic scholarships are also offered to international students; visit the official website for more information (link is provided at the end of the application process)."], "other_details": ["Transcripts", "Test score (optional)", "Personal Statement", "Letter of recommendation", "English language proficiency (IELTS 6.5, Duolingo 110, Internet-based TOEFL 80 or paper-based TOEFL 550)", "Official record of study", "Copy of passport", "Certificate of finance form"], "apply_link": "https://www.pacific.edu/financial-aid/scholarships/international-students"},
{"name": "OGDCL Internship Program 2021 (Paid Internship)", "funding_type": "Paid", "deadline": "2021-09-28 00:00:00", "description": "Another internship opportunity for Pakistani and AJK graduate students. Applications are open for the OGDCL internship program 2021. Oil and Gas Development Company Limited is offering one year paid internship program for fresh graduate students. Students from Engineering, MBA, BBA, BS, and MSc are invited to apply for the paid internship. OGDCL aims to practically train the youth to enhance their skills and provide them with experience. It will be an excellent addition to the CV.\nGraduate students of the following fields may apply petroleum engineering, chemical engineering, electrical and electronic engineering, mechanical engineering, mechatronics, civil engineering, environmental science, computer/software/telecom, geological engineering, geology, geographic, HR, Marketing, SCM, CMA, ACCA, MBA (finance) and BBA Hons.\nStudents from all provinces of Pakistan (Sindh, Punjab, Baluchistan, and KPK), FATA, Gilgit Baltistan, Azad Jammu, and Kashmir can apply. Total 300 seats are offered, internships will be allocated to the interns based on merit and the number of positions open for the specific region. As the internship is paid, interns will receive PKR 40,000 as a monthly stipend.\nDeadline is September 28, 2021", "region": "Pakistan", "eligibility": ["Candidates must have completed the degree before the closing of the application.", "Applicants who already once availed the opportunity before are ineligible.", "Candidates having district domicile or regions where fields are located will be preferred.", "NTS test will be conducted for the selection of interns."], "benefits": ["PKR 40,000 monthly stipend for one year.", "Certificate on completion of the internship."], "other_details": ["Sindh: 60", "Punjab: 60", "KPK: 60", "Baluchistan: 60", "FATA: 20", "AJK: 20", "GILGIT: 20"], "apply_link": "https://ogdcl.com/news/internship-program-under-corporate-social-responsibility-csr-0"},
{"name": "Davenport Academic Scholarships 2022, USA", "funding_type": "Partial Funded", "deadline": "2021-11-09 00:00:00", "description": "Davenport Academic Scholarships applications are now open. This program will help students by defraying the tuition fee for eligible courses at Davenport University in the USA. Davenport University is a private, non-profit institution founded in 1866. It provides staff, bachelor’s degree programs and master’s degrees, and diplomas in the enterprise, technology, healthcare, and graduate studies (MBA). Students from all over countries can apply for the scholarship.\nDavenport will provide real-world knowledge and hands-on experience on technology and critical thinking skills. Those who want to pursue undergraduate degrees from the USA can grab the opportunity. Students can pursue their degrees online. $10,000 would be provided for completing their studies. Davenport’s Academic Scholarships are awarded on a yearly basis to students who meet the GPA or ACT/SAT requirements.\nDavenport University was the first institute to be selected for a 2020 Michigan Performance Excellence Award. Davenport University also became the first university in Michigan to earn Investments Award. This award recognizes universities and colleges that have responded to challenges in innovative and creative ways that allow the institution to thrive.\nDeadline is November 9, 2021", "region": "USA", "eligibility": ["Applicants are accepted from around the world.", "The scholarship will be awarded in any of the subjects offered by the university.", "The applicants must meet the admission criteria of the program.", "The scholarship is limited to only five (5) recent high school graduates per academic year.", "In addition, aspirants must be international students."], "benefits": [], "other_details": ["Waiver countries-English official language", "ACT 18+ Reading & English", "SAT 450+ Evidence-Based Reading/Writing", "IELTS 6.0+", "TOEFL 61+", "Pearson Test of English (PTE) 46", "Duolingo 90", "AP English Language 3+ on AP English Exam", "IB English 5 on English A1 or A2 Exam", "Transfer College English and Math Credits", "US High School Graduation", "Successful completion of ELS Language Centers Level 112"], "apply_link": "https://www.davenport.edu/financial-aid/scholarships"},
{"name": "SKOLL Scholarship for MBA 2022 at the University of Oxford [Fully Funded]", "funding_type": "Fully funded", "deadline": "2022-01-12 00:00:00", "description": "The University of Oxford is offering a \n for the \n for the academic year 2022. The applications are now open to study in the UK. This is a one-year program offering educational funding and other academic supports. The scholarship is hosted by the SKOLL foundation and is administered by the SKOLL centre. SKOLL centre is located at the University of Oxford.\nThe SKOLL scholarships support young entrepreneurs who have already set up their work or have worked in social enterprises. The applicants can also apply those who have pursued an impact career and those who wish to gain a deeper understanding of market-oriented practices to pursue social change effectively. Scholars can avail this scholarship and get their hands to the SKOLL scholar community. The SKOLL community is a group of top-class world-changing thinkers, innovators, and entrepreneurs. Moreover, the SKOLL scholars community provides access to world-renowned entrepreneurs, leaders, and innovators.\nThe SKOLL scholarship is a competitive scholarship for future MBA students. Students who aim to bring solutions to urgent social and environmental issues. If you have a social purpose, then this opportunity is the right pick for you. This scholarship is offered in recognition that the MBA graduates may represent a significant financial burden.\nThe duration of the scholarship is one year to cover the financial requirements. Students who have personal financial issues can find it difficult to pursue higher education. That is why the SKOLL foundation offers scholarships aiming to support the students who desire to study and work in the social innovation space, opposed to the purely commercial or public sector.\nDeadline is January 12, 2022", "region": "United kingdom", "eligibility": ["Applicant must have entrepreneurial skills,", "Applicants must be able to create an Impact with a focus on System Change.", "Applicant must have personal qualities of being a social Entrepreneur.", "They must have completed their bachelor’s education.", "Applicants must be in need of financial support.", "Applicants must demonstrate the need for a scholarship, for example, due to previous work experiences or personal circumstances or you are in a position where the cost of the program is a significant financial burden."], "benefits": ["Full tuition will be covered.", "Partial living expenses will be covers up to £14,985.", "The program offers mentorship and supervision to master’s students.", "It will also cover other educational opportunities like support in research projects.", "You will get access to the SKOLL Scholars community.", "This will be a chance to come in contact with world-class innovators, thinkers, and entrepreneurs.", "It is a critical opportunity to flight your career."], "other_details": [], "apply_link": "https://skollscholarship.org/about"},
{"name": "Hong Kong PhD Fellowship Scheme 2022-2023", "funding_type": "Fully funded", "deadline": "2021-12-01 00:00:00", "description": "The golden opportunity for fresh full-time PhD students is now open for applications. The Hong Kong PhD Fellowship Scheme is open to students from around the world. The host universities fully fund the program. The aim is to recognize academically brilliant, talented, and motivated students who exhibit leadership qualities.\nResearch Grants Council introduces the Hong Kong PhD Fellowship scheme to pick out the brightest minds of the world for universities of Hong Kong. Students can apply in any two of the host universities to utilize their exceptional potential and skills.\nThis opportunity provides a platform for the students to interact with students from different cultures, high intellectual levels, and skills. You will get to study in any of the leading universities in Hong Kong. The applicant must possess communication skills, leadership skills, and research ability to be shortlisted. Moreover, the education quality of Hong Kong is one of the finest, which will give an everlasting educational experience. There will be 300 awards waiting for the right candidate. This Fellowship is for 3 years, which means this is a 3 years fully funded opportunity. Do not miss out the deadlines; further information is provided below.\nDeadline is December 1, 2021", "region": "Hong Kong", "eligibility": ["The applicant must be a fresh full-time PhD student.", "Applicants can be from any nationality.", "The applicant must prove that their university’s medium of education was the English language.", "In case the primary medium of education was not English, He/she has to provide an English proficiency certificate.", "If the applicant is not a fresh PhD student, he/she may apply for this program if he/she gets admission to any other new full-time PhD programs.", "The applicants have to choose their university from the list of host universities."], "benefits": ["Yearly stipend of HK$322,800 (for up to three years).", "Travel allowance of HK$13,500 for conferences and research-related travels.", "Additional support will be provided by the host university if the PhD extends from 3 years.", "The applicant does not have to have prior work experience for this Fellowship."], "other_details": ["Ling nan University", "The Chinese University of Hong Kong", "City University of Hong Kong", "Hong Kong Baptist University", "The University of Hong Kong", "The Hong Kong Polytechnic University", "The Hong Kong University of Science and Technology", "Sciences", "Medicine", "Engineering and Technology", "Humanities", "Social Sciences", "Business Studies"], "apply_link": "https://cerg1.ugc.edu.hk/hkpfs/index.html"},
{"name": "YES Youth Exchange Program 2022-2023 For Pakistani Students", "funding_type": "Fully funded", "deadline": "2021-09-15 00:00:00", "description": "The wait is over, \nis accepting the application for 2022-2023.\nThe YES Youth Exchange Program is a study program for Pakistani students. All high school students in Pakistan can apply. Applicants must be in the ninth and tenth grades in school. This exchange program is fully funded by the Office of Educational and Cultural Affairs (ECA) of the US Department of State. UU. To provide scholarships to high school college students of the nations to spend a year in the United States.\nThe Kennedy Exchange and Youth Study (YES) Scholarships are funded by the Office of Educational and Cultural Affairs of the US Department of State. In the US, high school students from 39 countries are given the opportunity to study in American high schools and live with American host families. The YES Scholarship Program is implemented by a consortium of organizations led by the American Councils.\nStudents are enrolled in a full academic year of high school studies in the United States, attending classes, labs, and extracurricular activities with their American classmates. The YES participants also participate in special enrichment activities, which include community service, youth leadership training, a civic education program and other activities that develop a comprehensive understanding of American culture through interaction with various groups of Americans. Similarly, participating students act as cultural ambassadors of their American host communities, becoming invaluable resources for Americans, whose contact with YES students gives them the opportunity to learn about the rich and vibrant culture of the countries of origin of the students.\nSince 2003, the Kennedy-Place Youth Exchange and Study (YES) program have awarded scholarships to 1,274 high school students from all over Pakistan. So what are you waiting for? Don’t let go of this chance to visit America and study in American high schools.\nDeadline is September 15, 2021", "region": "USA", "eligibility": ["A minimum of 60% of marks in all the subjects within the examination.", "Students may have to submit their final exam grade sheets once they get the grade sheets.", "The applicant must be 15-17 years old.", "The candidate must be a student in the Secondary school of Pakistan, enrolled in 9", " or 10", " grade or O Levels.", "The candidate must have obtained a minimum of 60% marks in all subjects, especially Mathematics, Science, and English, and have 60% average obtained marks for the past/last three academic years.", "The students who took a year gap, break, or repeated the year are not eligible for this program.", "The candidates must be proficient to communicate in English.", "The candidate should also meet U.S J-1 visa eligibility.", "The candidate must be a citizen and permanent resident of Pakistan and have never travelled to the United States before.", "Students with disabilities (disable students) are also encouraged to apply if they meet the above criteria and contact their YES office for further information."], "benefits": ["Round-trip airfare to US,", "Pre-departure orientation cost,", "Placement with a Host family for 10-11 months,", "Monthly stipend,", "Health insurance,", "Program activities and material costs."], "other_details": ["Applicants will take an English proficiency test and write a proctored essay.", "Then complete the preliminary application and lastly appear in the interview.", "Send the photocopies of your original documents with the application as they will not be returned; do not send original ones.", "Students whose schools are not interested students can apply privately, visit the official website for detailed information.", "All the selected candidates will be notified for the entry test through letters sent to the applicants’ address provided in the application.", "Students who succeed in the test will be notified for the interview and final application. Then candidates will take the English Language Proficiency Test."], "apply_link": "https://yesprogram.pk/"},
{"name": "ILRI Paid Internship 2021 (Short Term)", "funding_type": "Paid", "deadline": "2021-09-15 00:00:00", "description": "Applications are open for ILRI paid internship 2021. The International Livestock Research Institute (ILRI) is offering a short-term internship program for the youth. It is a paid opportunity in Nairobi, Kenya. The duty will be 5 days per week, and the program will be 3 months or less. Program duration can be increased to 6 months.\nThe program will help the students learn under the supervision of experienced staff members. The work will be in their assigned departments. ILRI aims to improve food and nutrition security and also reduce poverty in developing countries. It can be achieved with the help of research on the efficient, safe, and sustainable use of livestock.\nThis program is a short-term internship for young professionals aiming to join ILRI. This will last for 3 months or less. The internship will play a role in their academic curriculum activity, and students are required to resume their degrees upon completing the internship.\nDeadline is September 15, 2021", "region": "Kenya", "eligibility": ["Nationals of any country can apply.", "Currently, be enrolled in any undergraduate program at any university.", "At least one semester must be completed of the undergraduate degree.", "Senior high school students and students of diploma/certificates are eligible for internships.", "Applicants must good knowledge and must be able to use Microsoft Office professionally.", "Applicant must have an English proficiency certificate."], "benefits": ["Students will get to work under the supervision of experts.", "Students will have their mentors to guide them throughout.", "Interns will receive a monthly stipend and insurance."], "other_details": ["Detailed CV", "Motivation letter", "Internship request letter from their university"], "apply_link": "https://www.ilri.org/jobs?jid=30501-ilri-internship"},
{"name": "Beloit College Merit Scholarships 2022, USA", "funding_type": "Partial Funded", "deadline": "2021-11-01 00:00:00", "description": "The applications for the \n 2022 are now open. Brilliant students are encouraged to apply for the merit scholarship. Beloit College aims to elevate talented students who can be future leaders. Contributing to making a sting community of future scholars, leaders, and innovators, Beloit has commenced scholarships to help financially unstable students pursue their degrees. Beloit College is a private college of arts in Beloit, Wisconsin. It was founded in 1846. It is now the state’s oldest operating college. The Beloit College has an enrolment of approximately 1,400 undergraduate students every year. As of 2019, Beloit was ranked #68 among national liberal arts colleges by U.S. News & World Report and #38 by Washington Monthly.\nStudents at the Beloit College will be exposed to experimental learning, learner agency, and reflective connection making. Connection-making between in-door and out-door learning will help students gravitate towards the type they can learn in. This will make them understand their learning ability.\nA course like anthropology and geology are the strengths of Beloit College. In addition, many of the alumni of this college have now earned their PhD degrees.\nDeadline is November 1, 2021", "region": "USA", "eligibility": ["Students can have only one scholarship at a time.", "Incomplete application forms will not be considered for the scholarship.", "Students must prove their academic achievements and performances with certificates and academic transcripts.", "Students must possess talent and leadership skills.", "They must demonstrate academic excellence as the scholarships are awarded based on merit."], "benefits": ["A scholarship of $36,000 worth will be awarded; the scholarship can be combined up to USD 41,000 per year.", "Scholarship renewal is possible if the awardee shows satisfactory academic results and meets the criteria."], "other_details": [], "apply_link": "https://www.beloit.edu/admission/tuition-aid/merit-scholarships/"},
{"name": "Somnium Times Fiction Story Writing Contest 2021", "funding_type": "Fully funded", "deadline": "2021-09-30 00:00:00", "description": "The Somnium Times is hosting a fiction story writing contest. The applications are now open for the Prize of $500. Sommnium Times fiction unfolds in the Metaverse. The term is usually used to define the concept of a future iteration of the internet, 3D virtual spaces linked into a perceived virtual universe. Somnium space is one of the destinations in the Metaverse. For the writing contest, the somnium times is looking for enchanting fiction that has physical reality and virtual reality.\nThe contestants can combine both realities in their stories as long as it is intensely relevant to the somnium space. Stories can also be focused on somnium space without any connection to physical reality. The competition does not accept erotica, violence, and gory content. Any other material that might shock or disgust the readers will not be considered.\nDeadline is September 30, 2021", "region": "Online", "eligibility": ["The contest is open to all.", "Anyone from any country can participate in the contest.", "Just make sure you join the Discord server of Sommnium times and have access to the Metamask browser."], "benefits": ["$500 in Somnium Cubes + Publication on their official website", "$200 in Somnium Cubes", "$100 in Somnium Cubes"], "other_details": ["Participants must write a short sci-fi story interpreting somnium Space.", "The story can be a mixture of physical reality with virtual reality as long as part of the action occurs in Somnium Space.", "The story must not exceed 3000 words.", "Participants can submit a maximum of three stories. If one participant submits more than three stories, only the first three submissions will be considered for the contest.", "Before submitting your story, make sure your discord name, email address, alias, and contest ID are on the story’s front page."], "apply_link": "https://somniumtimes.com/short-fiction-contests/"},
{"name": "Fulbright National Geographic Storytelling Fellowship 2022-23", "funding_type": "Fully funded", "deadline": "2021-10-12 00:00:00", "description": "The applications for Fulbright-National Geographic Storytelling Fellowship are open now. Interested candidates are welcome to apply for the fully funded fellowship program. The host organization will cover all the other expenses during the program.\nThe program is hosted by National Geographic for the students of any Fulbright award active country. Students will be participating in an academic storytelling competition based on a globally significant theme. During the Fulbright fellowship program, National Geographic will also offer editorial mentorship to the candidates. In addition, the candidates can pitch their stories to National Geographic’s other platforms.\nThe Fellowship will prefer proposals that examine an issue from a global perspective to enhance Fulbright research or artistic projects in 2022-2023. For example, human Ingenuity and Human History & Cultures are particularly significant to the National Geographic Society. The storytelling tools available to storytellers include writing, photography, video, audio/podcast, maps, and graphic illustrations. What are you waiting for? Apply now for the Fulbright-National Geographic Storytelling Fellowship and avail this fully-funded opportunity.\nTo light up and protect the wonders of our world, the National Geographic Society uses science, exploration, education, and storytelling. Individuals with a passion, aim, and talent for storytelling are encouraged to apply for the Fulbright-National Geographic Fellowship. Science, technology, and storytelling projects that seek to conserve our planet’s land and oceans, understand human history and culture, and create a more sustainable future are encouraged.\nDeadline is October 12, 2021", "region": "USA", "eligibility": ["Students from any field of study are eligible to apply.", "For the Fulbright-National Geographic Storytelling Fellowship, applicants from any country (for which the Fulbright award is active) are welcome to apply.", "Applicants with illustrated experience and talent in storytelling will be given preference.", "Candidates must have completed at least an undergraduate degree by the time of application.", "Permanent U.S citizens are ineligible for this Fellowship.", "Applicants of the Fulbright English teaching assistant program are ineligible for this Fellowship.", "National Geographic staff or persons currently on assignment with grants funded by national Geographic or state department are ineligible.", "Former National Geographic Staff is eligible to apply.", "Applicants can not apply for more than one type of Fulbright U.S student grant. This includes study/research and ETA Grants."], "benefits": ["Full travel costs will be covered.", "Living expenses will be covered.", "Health insurance.", "An allowance will be provided for material and reporting expenses.", "Storytellers will be guided for storytelling methods.", "Editorial mentorship for Fellows will be provided during the Fellowship period."], "other_details": [], "apply_link": "https://us.fulbrightonline.org/fulbright-nat-geo-fellowship"},
{"name": "AAUW International Fellowship Program 2022, USA", "funding_type": "Partial Funded", "deadline": "2021-11-15 00:00:00", "description": " is a partially funded scholarship offered by The American Association of University Women, USA. Eligible students from all nationalities (except the USA) are eligible. This scholarship is offered for graduate and postgraduate studies in any subject offered by the university. AAUW Fellowship Program covers \n, contingent upon meeting academic standards for renewal. The American Association of University Women grants fellowships for full-time study or research in the US.\nPostgraduate and graduate studies at accredited US institutes will be supported. Originally designed to provide Latin American women with graduate and postgraduate study opportunities in the US, the International Fellowships program was awarded its first fellowship in 1917. The program now includes women worldwide, and International Fellowships have been awarded to more than 3,600 women from more than 150 nations.\nDeadline is November 15, 2021", "region": "USA", "eligibility": ["Applicants must have citizenship in a country other than the US or possess a non-immigrant visa if residing in the US.", "They must hold an academic degree equivalent to a US bachelor’s degree completed by 15th November 2021.", "Intend to devote full-time to the proposed academic plan during the fellowship year.", "Intend to return to her home country.", "Be proficient in English.", "Applicants must intend for masters or professional degree-level programs such as JD, MFA, L.L.M., M.Arch, or medical degrees including MD, DDS.", "Doctoral fellowships are offered for doctorate degrees (PhD or Ed.D).", "Postdoctoral applicants must provide proof of their doctorate, hold a doctorate classified as a research degree, and they must indicate their research.", "Master’s professional degree and doctoral applicants must be enrolled in a US accredited institution located in the US during the fellowship year.", "Applicants must conduct a full year of study or research. Programs ending before April of the fellowship year are not eligible."], "benefits": [], "other_details": ["Proof of highest degree.", "Proof of current enrollment (currently-enrolled applications only).", "Proof of bachelor’s degree.", "Proof of doctorate or MFA degree (postdoctoral applicants only).", "Official report of TOEFL test scores", "Letter of admission.", "CV/Résumé", "Three recommendations from those who are well acquainted with the work and your academic background."], "apply_link": "https://www.aauw.org/resources/programs/fellowships-grants/current-opportunities/international/"},
{"name": "Tulane University Merit Scholarship 2022, USA", "funding_type": "Partial Funded", "deadline": "2021-12-01 00:00:00", "description": "Applications are open for \n for the academic year 2022.\nTulane University is seeking highly talented students to apply for merit-based scholarships in the USA. International applicants who wish to pursue \n at Tulane University can apply. Applicants must be non-US (international) citizens or residents who can certify that they can contribute the rest amount towards their study to be eligible to receive this scholarship.\nTulane University is a private research institute in New Orleans; it ranked #41 in the 2021 edition of Best Colleges is National Universities. The primary purpose of Tulane University is to create, communicate, and conserve knowledge to enrich individuals, organizations, and communities’ capacity to think, learn, and act and lead with integrity and wisdom. Tulane University offers its students learning experiences inside and outside of the lecture room.\nGraduates of Tulane University are prepared for the challenges of the real practical world. Batch sizes at Tulane is 15 students, enabling them to get to know everyone, including the professor. In addition, it maintains a global campus emphasizing cultivating an international and multicultural climate and engaging the global community through study abroad programs.\nDeadline is December 1, 2021", "region": "USA", "eligibility": ["Applicants must be identified as international students (non-US citizens or residents).", "The applicants must confirm that they can afford the rest of the university.", "Applicants must be accepted and enrolled into the university.", "SAT, ACT, GRE, or GMAT scores are required to gain admission to the university.", "Applicants must submit the language proficiency scores; minimum required scores for English proficiency are:", "TOEFL – 95 or above", "IELTS – 6.5 or above", "Duolingo – 115 minimum"], "benefits": [], "other_details": ["Transcripts", "Certificate of Finances Form", "Interview (if required)", "Portfolio", "Letter of Recommendation", "Resume", "Statement of Purpose"], "apply_link": "https://admission.tulane.edu/tuition-aid%20"},
{"name": "NCTU Scholarships by National Chiao Tung University 2022", "funding_type": "Fully funded", "deadline": "2021-09-30 00:00:00", "description": "The National Chiao Tung University was established in 1958. After 60 years of development, NCT university is now ranked 4 in Taiwan and 427\n  in the world. NCTU has an outstanding academic performance in the fields of information, communications, primary research, biotechnology, humanities and social sciences. Currently, there are more than 14,000 domestic and international students enrolled at the NCTU.\nDeadline is September 30, 2021", "region": "Taiwan", "eligibility": ["Applicants must be international students.", "Citizens of Taiwan are ineligible for this program.", "Applicants must be physically and mentally fit.", "Applicants may not be receiving any other scholarship at the time of the NCTU scholarship.", "Applicants must complete the NTCU scholarships application form correctly and submit it along with other required documents.", "Students who have received their high school degrees are eligible for a bachelor’s program.", "Applicants with an undergraduate degree are eligible for the master’s program.", "Applicants with a master’s degree are eligible for PhD program."], "benefits": ["Bachelor’s students will receive a monthly stipend of up to NT$21,000 (US$700)", "Master’s students will receive a monthly stipend of up to NT$22,000 (US$733)", "Tuition fees of master’s students will be exempted", "Master’s students will get assistantship from the advisor of research", "PhD students will receive a monthly stipend of NT$29,000 (US$966)", "The tuition fee of PhD students will be exempted.", "The assistantship will be given to PhD students for research work."], "other_details": ["An online Application form must be submitted with complete data", "Highest degree verified with official stamps", "Highest degree transcript", "Two recommendation letters", "Passport", "Written study plan(in English or Chinese)", "English proficiency certificate", "If the previous degree was taught in English, then the applicant can ask their university for an official statement stating that the primary language of their institute is English.", "Academic thesis or relevant publications (for PhD applicants)", "College of humanities and social sciences", "Faculty of system engineering", "College of Hakka studies", "College of science", "College of engineering", "College of management", "College of computer science", "College of biological sciences and technology", "College of electrical engineering", "College of computer engineering", "College of photonics", "International college of semiconductor technology", "College of artificial intelligence and green energy", "School of law", "For more information regarding undergraduate programs, ", "For more information regarding masters and PhD programs, "], "apply_link": "https://oia.nctu.edu.tw/en/degree-seeking/international-students/scholarship/"},
{"name": "Alta Scuola Politecnica Scholarships 2021, Italy", "funding_type": "Fully funded", "deadline": "2021-10-14 00:00:00", "description": "Applications for Alta Scuola Politecnica scholarships 2021 in Italy are open for international students. The scholarships in Italy are fully funded and open to all nationalities to pursue graduate (master’s) studies.\nThe Alta Scuola Politecnica aims to promote talented and brilliant students worldwide motivated to get a postgraduate degree. The students of ASP are leaded towards a path of comprehensive training to understand the compound connection between science, innovation, technology, and socioeconomic systems. With the help of this knowledge and understanding, students will be able to impact society positively. It will develop the skill of problem-solving in the students and have multiple points of view. Students will be able to present feasible solutions.\nAll courses will be delivered in English to build a cross-cultural environment of sharing knowledge and skills. The courses will focus mainly on common issues faced by any new engineering, architecture, and design project. Courses will be held in the form of an Intensive School schedule. The courses will be a combination of lectures, seminars, and group discussions.\nDuring the 1\n year of the Masters’s degree, students will learn innovation, decision making, dynamics of innovation. The study will be from both management and economics points of view. The aim will be to introduce the students to a broad range of innovation methods, from analyzing design processes to tools that give a structured approach to design.\nDuring the 2\n year of a master’s degree, students will have new experiences. Students will be introduced to technology and digital innovation. Along with this, students will be receiving courses on communication skills and presentation skills. In addition, students will focus on raising awareness on communication issues and developing advanced skills on being clear and persuasive.\nDeadline is October 14, 2021", "region": "Italy", "eligibility": ["Students from any nationality and all countries are eligible.", "Selected candidates enrolled in the first semester of their degree at the Laurea Magistrale program are eligible for admission at ASP.", "This program is for graduates having a bachelor’s degree or equivalent.", "Students are bound to attend all the residential courses."], "benefits": ["Tuition fee waiver for the two-year program (does not include the regional tax and administrative fee).", "ASP will cover transport costs.", "Residential costs and meals will be covered during the ASP study period.", "Students will receive financial support for their activities related to academic projects. This will be according to the annual financial availability."], "other_details": [], "apply_link": "https://www.asp-poli.it/students-financial-benefits-a-y-2020-21/"},
{"name": "University of Hawaii Scholarship 2022 (Fully Funded)", "funding_type": "Fully funded", "deadline": "2021-12-01 00:00:00", "description": "The applications are now open for the \n for the academic year 2022. The University of Hawaii is offering scholarships to international students. This is a fully-funded scholarship offered to help the students in need of financial support. The scholarship program is for \n. The duration for master’s degree program’s is for 2 years, and the doctoral degree is for 3 years.\nStudents interested in pursuing their postgraduate or PhD degrees in America must not miss this golden opportunity. The scholarship program is fully funded and requires no application fee while applying for the scholarship. Along with covering the tuition fee, the University of Hawaii will also be covering the living expenses. In addition, the institute will monetarily support any project related to the degree.\nThe University of Hawaii is known as one of the oldest research institutes in the United States. It has also gained a name in the field of research. A large number of international students apply to the University of Hawaii every year, and only the brilliant, talented and outstanding students are selected to be part of the institute. Many students aim to get an education from this prestigious university.\nThe University of Hawaii scholarship open applications year for needy, talented students who cannot afford higher education from a reputable university. Their financial aid is visibly not limited to American students; the support is also open to international students from around the world. Do not miss out the chance to study at America’s famous university. This fully-funded scholarship will open doors to your career. For more information about the University of Hawaii Scholarship in the USA, check the information provided below and follow the instructions accordingly.\nDeadline is December 1, 2021", "region": "USA", "eligibility": ["Both male and female students can apply.", "Applicant must have a relevant undergraduate degree to apply for the master’s degree.", "Candidates applying for PhD degree must be holding a master’s degree.", "Only applicants from the eligible countries can apply.", "Applicant must be holding an English proficiency certificate.", "Applicants must have at least 2 years of work experience at the time of application.", "Students under the age of 35 can apply.", "Applicants must be healthy (mentally and physically) to attend the scholarship program."], "benefits": ["No application fee will be charged.", "Full tuition fee will be covered.", "An allowance will be provided for books and other academic supplies.", "Housing/residence will be provided.", "Health insurance subsidies will also be covered.", "Living expenses will be provided for food and other expenses.", "Students will be working on their projects under the supervision of professionals."], "other_details": [], "apply_link": "https://www.eastwestcenter.org/education/ewc-graduate-degree-fellowship"},
{"name": "Tapirulan Illustrators Contest 2021", "funding_type": "Fully funded", "deadline": "2021-10-25 00:00:00", "description": "Tapirulan Association opens registration for their 17th Tapirulan Illustrators Contest, and the theme of the contest is STOP. Artists from any country and any part of the world can apply; artists from all nationalities are invited to participate by sending in their work in a square format. Candidates can only submit only work that has not been published or used elsewhere.\nThe first prize that will be awarded by the Jury is 2,500 Euro and an invitation for an exhibition at the Tapirulan Gallery, with the publication of the personal catalogue. All selected authors will exhibit their work in Italy from 14 May to 26 June 2022. Twelve of the selected authors will have their work included in the Tapirulan calendar 2022.\nThe purpose of the Tapirulan contest is to award an illustrator, attract visitors, and grab public attention and promote artwork as a profession. The result will be an exhibition of approximately 250 artworks.\nDeadline is October 25, 2021", "region": null, "eligibility": ["Artists from all nationalities can participate in the Tapirulan Illustrators Contest 2021.", "There is no age limit.", "Underage candidates will require parents’ authorization."], "benefits": ["Forty-eight artworks will be selected to be published in the catalogue and a chance to display in the exhibition.", "12 top artworks will be published on the calendar, and a 2.500 euros prize will be awarded.", "Furthermore, in the next edition, the prize winner will be invited to exhibit his/her works at a solo show in Cremona.", "In addition, 48 artworks selected by the Jury will also be published in the exhibition catalogue and online on the official website.", "The artist who will secure the most votes will receive a prize of 500 euros."], "other_details": ["Any medium and all techniques are allowed.", "The artwork should be square-shaped, minimum 25×25 cm, and maximum 40×40 cm.", "Artwork is applied on a panel or frame; it must not exceed 3 mm in thickness.", "The size of the digital image must be 31×31 cm in JPG format (300 dpi – best quality)."], "apply_link": "https://illustratorscontest.tapirulan.it/en/"},
{"name": "Globalink Research Internship for Summer 2022, Canada", "funding_type": "Fully funded", "deadline": "2021-09-22 00:00:00", "description": "Opportunities circle is here to share internship opportunity, Globalink Research Internship in Canada, for the summers of 2022. The fully-funded program is offered to successful candidates from participating countries avail once in a lifetime opportunity of a 12-week summer internship at a Canadian institute. The internship will take take place in summer of 2022: interns will get a chance to work on a research project of their choice (under the supervision of a Canadian supervisors). The GRI program pairs faculty in Canada with international undergraduate students for 12-week research projects.\nThe 12 Week Mitacs Globalink Research Internship consists of a variety of academic disciplines, Science, Mathematics, Engineering, Humanities and Social Sciences. Undergraduate, Master, and Ph.D. Degree Students can apply. Both Male and Female Participants can apply. The aim of Mitacs is to build a bridge between Canada and emerging international research talent. Globalink Research Internship is open to all disciplines. This internship is collectively funded by Mitacs and the UK for a total of 40 places. Their university must nominate all students applying for the internship.\nDeadline is September 22, 2021", "region": "Canada", "eligibility": ["Applicants must be at least 18 years old.", "They must be enrolled in a full-time Undergraduate or Master’s Program.", "Applicants must be available to complete a 12-week internship, arriving in Canada between May 1 and July 31, 2022.", "They must have a valid passport at the time of application (until at least January 2023).", "They should submit an official transcript from the home university in English or French.", "Letter of Reference (at least one) from a Professor or Research Supervisor is required.", "CV with details of research experience."], "benefits": ["Round-trip airfare ticket to and from Canada (amount may vary on the country of origin of internee),", "Transportation from Airport to accommodation,", "Housing allowance,", "Health insurance,", "Student enrollment fees stipend up to $300,", "Allowance for food and incidentals,", "Student mentorship on campus in Canada.", "Industry events and professional development courses", "Certificate of completion.", "Develop research expertise with top professors with outstanding research facilities.", "Enhance important skills for the workplace, including research skills, critical and creative thinking, cultural awareness, and developing a global outlook.", "A chance to interact with companies of interest through tours or individual meetings."], "other_details": [], "apply_link": "https://www.mitacs.ca/en/programs/globalink/globalink-research-internship"},
{"name": "ADB Internship Program 2021 (Paid Internship)", "funding_type": "Paid", "deadline": "2021-09-15 00:00:00", "description": "ADB Internship is an excellent opportunity for young graduates for pursuing a successful career. The ADB internship program is an opportunity for interns to work on project-oriented schemes and mechanisms and a diverse working environment spread all over 60 countries of ADB. It is a great opportunity for graduates to gain professional experience based on research and assignments under the supervision of world-class professionals. ADB offers internships twice a year. Highly talented, motivated, and impactful individuals are being selected for an international internship at the ADB. The purpose of the summer and winter biannual paid internship program is to bring talented graduates into the same pool to make a huge difference together.\nThe ADB Paid Internship 2021-22 has created an opportunity for economic and development impact both in their developing countries’ public and private sectors. International interns at ADB will have the chance to work on their desired assignments and apply for the specifically chosen assignments during their application process. There are many projects related to sustainable social and economic development on which the Asian Development Bank is currently working. The other projects include decreasing the impacts of the COVID-19 pandemic by offering vaccines, knowledge, finance, and partnership.\nAsian Development Bank has a partnership with other international multinational banks and multilateral financial organizations such as World Bank, Asian Infrastructure Investment Bank, European Bank for Reconstruction and Development, Global Environment Facility, World Health Organization, World Trade Organization, Organization of Economic Co-operation and Development, and many more.\nEight weeks to 26 weeks\n \nDeadline is September 15, 2021", "region": null, "eligibility": ["Applicant must be enrolled in a master’s or doctorate. Degree program.", "You must have excellent communication skills in English.", "Must be dedicated to academic study in a field directly related to the work of ADB.", "Applicants must be nationals of ADB countries.", "Applicants should have studied relate to one of ADB’s projects"], "benefits": ["A stipend for international interns according to the location, the allowance will be paid for up to fifty-seven days.", "The interns will get an opportunity to start their careers from a world-class organization, working under the supervision of highly talented, experienced professionals.", "Work in collaboration with international students from different countries.", "Contribute to the ADB business through analytics results."], "other_details": [], "apply_link": "https://www.adb.org/work-with-us/careers/internship-program#accordion-0-11"},
{"name": "Vistula University Merit Scholarship 2022", "funding_type": "Fully funded", "deadline": "2022-01-15 00:00:00", "description": "Applications are open for Vistula University Merit Scholarship for the academic year 2022. The scholarships are offered to international students who want to pursue bachelor’s or master’s programs and act as ambassadors for Vistula University. The scholarships can be undertaken for March 2022 session. Vistula University scholarship is open for new students coming from any country from all over the globe except Poland. They can pursue full-time master’s and bachelor’s studies in any discipline offered at the institute. In addition, 70 scholarships will be awarded to the most talented students with the highest academic record and leadership qualities.\nThe Vistula University merit scholarship will provide a 100% tuition fees discount; the scholarship will cover the tuition fee for the degree program duration if the students demonstrate high academic performance and participate in extracurricular activities.\nVistula University provides support to outstanding students through this scholarships program. The scholarships are offered to international students from any region or country. Vistula University is one of the most recognized institutions of Poland on an international level. The aim is to financially help the brilliant students who can not afford education from a well-known university.\n \nDeadline is January 15, 2022", "region": "Poland", "eligibility": ["Applicants must be non-polish international students.", "Applicant must have an outstanding academic record and have participated in extracurricular activities.", "Applicants must have achieved a minimum of 6.0 in IELTS or equivalent international English proficiency certificate.", "The scholarship will be provided on a competitive basis.", "Applicants must demonstrate good academic performance."], "benefits": ["Selected students will receive a 100% tuition fee exemption for the first year of education.", "The chances of tuition fee exemption for all the semesters will be high in maintaining high academic and extracurricular performance."], "other_details": [], "apply_link": "https://www.vistula.edu.pl/en/programmes/promotion/vistula-university-merit-scholarship"},
{"name": "KOÇ University Scholarship in Turkey, 2021-2022", "funding_type": "Fully funded", "deadline": "2021-09-15 00:00:00", "description": "Applications are open for the \n for the academic year 2022. Koc University is offering fully funded scholarships for international students who wish to continue their higher studies in Turkey. The scholarships are offered to pursue undergraduate, Master’s, and PhD programs.\nStudents can undertake \n under the Koc university scholarship. All the academic fields are offered for undergraduate program scholarship except medicine and nursing. Postgraduate scholarships are offered for Graduate School of Social Science and Humanities and Graduate School of Science and Engineering (with Thesis programs are only offered). \nOnce you apply, your application will be automatically considered for scholarships, but read all the details provided in this article and visit the official website too, in case we missed any important point.\nKOÇ University is a private sector non-profit university located in Istanbul. It is regarded as a top-ranked university for international students to study abroad. QS World Ranking ranked Koc University #465\n best university for the students globally for 2021. It\nDeadline is September 15, 2021", "region": "Turkey", "eligibility": [], "benefits": ["\n", "Undergraduate applicants will receive 50% or 100% (only tuition fee) Koc University Scholarships after evaluating academic merit by the admission committee.", "There are need-based scholarships too that will support the students by covering the expense for dorm and tuition.", "For more info regarding the Koc University Scholarships for undergraduate students, visit this ", ".", "\n", "\n", "Fully tuition fee waiver,", "Monthly stipend,", "Accommodation,", "Other benefits.", "\n", "\n", "100% tuition fee waiver,", "Monthly Stipend,", "Accommodation,", "Health Insurance,", "Office Space,", "Travel Grants (on a competitive basis).", "\n"], "other_details": ["CV", "Transcripts/Diploma", "Recommendation letters and Referee Contact Info", "Other documents required by the specific program department", "Statement of Purpose", "Research Plan (Graduate Applicants)", "English Proficiency Certificate GMAT / TOFEL", "Field related Experience required", "3 Essays", "Application fee payment slip"], "apply_link": "https://international.ku.edu.tr/graduate-programs/tuition-and-scholarships/"},
{"name": "Scotland Scholarship for Pakistani Women 2021", "funding_type": "Fully funded", "deadline": "2021-09-15 00:00:00", "description": "Applications for \n are open. The scholarship is open for Pakistani women aiming to pursue their degrees. The Scotland scholarship will provide total financial aid for \n students. The Scotland government aims to support women in achieving their dreams of higher education. Students must be enrolled in HEC recognized institutes.\nThis scholarship program is offered by the British Council Pakistan. The scholarship will cover the tuition fee of the selected candidates as well as their hostel fee. So don’t miss this opportunity to get the tuition fee covered. Apply before the deadline.\nDeadline is September 15, 2021", "region": "Pakistan", "eligibility": ["This program is only for female students,", "No age limit,", "Students applying for the undergraduate scholarship must be pursuing a four-year bachelor’s degree in the areas available,", "Master’s students must be pursuing a two-year degree in the subject areas available for this program,", "Applicants must have an offer of admission from a higher Education Commission recognized university in Pakistan,", "Women with disabilities, rural areas, minorities are encouraged to apply,", "Only women who wish to study in Pakistan are eligible for this scholarship."], "benefits": ["Tuition fees will be covered,", "The University hostel fee will be covered."], "other_details": ["Filled application form", "CNIC copy", "Copy of your transcript", "Proof of admission", "Tuition fee form/receipt"], "apply_link": "https://www.britishcouncil.pk/programmes/education/scholarships"},
{"name": "Khalifa University Scholarships 2022, Fully Funded", "funding_type": "Fully funded", "deadline": "2021-10-16 00:00:00", "description": "Applications are now open for the Khalifa University Scholarships for the academic year 2022. The scholarships are offered for undergraduate, postgraduate, and Ph.D. programs. No application fee required for this scholarship. Because this scholarship is fully funded so you do not need to worry about financial expenses. The institute is known as one of the best universities in the UAE.\nKhalifa University warmly welcomes it is new students. This can be an open window leading students towards a leading career. Khalifa University is well known for technology, education, and research. Fields open for the scholarship are listed in the article.\nYou can apply for the scholarship in any field as there is no academic field restriction, either business, IT, Arts, or Engineering. Applications are ongoing so hurry up, make up your mind and apply. Scholarships are offered to all students, there is no nationality barrier, and even students from UAE can apply.\nThe institute will cover almost all the necessary expenses during the degree program. So do not miss the opportunity to study in one of the best universities in UAE. Apply before the deadline and give the career a boost.\nFull time degree students are required to register for 3 to 4 courses each semester. 9 to 12 credit hours or equivalent, and part-time students are required to register for two courses each semester. 6 credit hours or equivalent\n \n \nDeadline is October 16, 2021", "region": "UAE", "eligibility": ["Must have completed their secondary high school,", "They must have an English proficiency score or equivalent iBT TOEFL, IELTS or EmSAT,", "Must appear for the admission interview.", "Must have completed their bachelor’s degree with a minimum CGPA of 3.0 on the scale of 4.0,", "Must have English proficiency certificate,", "Applicants must have a minimum score of 150 in the GRE (graduate record examination),", "Must appear for the admission interview.", "Must have completed their Master’s degree with CGPA of 3.25 in a relevant discipline,", "Must submit a research statement of 500 to 1000 words,", "Must appear in the admission interview."], "benefits": ["No application fee will be charged,", "Full tuition fee will be covered,", "Medical insurance,", "University will support the students to attend International Research Conferences,", "A monthly stipend will be provided,", "AED 8,000 will be provided to Master’s degree students, AED 10,000 will be for PhD students."], "other_details": ["CV", "Passport", "Transcripts", "Degree certificate", "Personal statement", "Passport size picture", "Statement of purpose", "Recommendation letter (2)", "Research statement (PhD applicants)"], "apply_link": "https://www.ku.ac.ae/scholarships"},
{"name": "MasterCard Foundation scholarship 2022 (For African Students)", "funding_type": "Fully funded", "deadline": "2021-10-31 00:00:00", "description": "The University of Pretoria is offering a \n for the academic year 2022. The University of Pretoria (UP) has collaborated with the MasterCard Foundation to commence a scholarship program for postgraduate students. Talented and outstanding African students can achieve their goals and dreams, which is only possible by pursuing higher studies. It is an excellent opportunity for African students to enhance their skills, knowledge and leadership skill.\nThe scholarship program is open only for African students aiming for a \n. The MasterCard foundation scholars program (MCFSP) desires to develop the continent of Africa by providing support to talented and motivated students who are facing a financial crisis. Students who have the potential to transform their continent economically and positively through their knowledge are encouraged to apply for the MasterCard Foundation Scholarship.\nDeadline is October 31, 2021", "region": "South Africa", "eligibility": ["Students belonging to African countries are eligible for the MasterCard Foundation Scholarship.", "Applicants must receive an admission offer from the University of Pretoria. Students must get admission to a full-time postgraduate degree.", "The student’s contact will be requested to complete the MCFSP application.", "Applicants must submit their educational records and others supporting documents.", "Applicants must provide complete and correct information; submission of false information may lead to disqualification from the scholarship.", "Applicants must return to their home countries after completing their scholarship and contribute to the development of their country."], "benefits": ["The MasterCard Foundation Scholarship program provides the following benefits:", "Full tuition fees,", "Accommodation,", "Meals will be provided in a UP residence or UP-accredited accommodation,", "Monthly stipend,", "Textbooks and other required materials,", "Medical aid will be covered during the scholarship,", "The cost of a Visa will be provided,", "A suitable travel allowance will be provided, which means airfare to and from the applicant’s home country,", "Leadership development opportunities,", "Academic advising and counselling."], "other_details": [], "apply_link": "https://www.up.ac.za/mastercard-foundation-scholarship-program/"},
{"name": "UNDP Internship in Fiji 2022", "funding_type": null, "deadline": "2021-12-31 00:00:00", "description": "Applications are open for \n for the year 2022. The United Nations Development Programme is offering an internship in Fiji. The resident coordination office of UNDP invites applicants to join the organization in one of the specialized areas. The UNDP internship program is open for all international applicants as the UNDP provides opportunities for youth regardless of gender and nationality.\nUNDP (United Nations Development Programme) aims to achieve workforce diversity in culture, background, nationality and gender. Candidates must have good communication and leadership skills; they must be able to manage teams.\nDeadline is December 31, 2021", "region": "Fiji", "eligibility": ["Candidates must be enrolled in a degree program in social sciences, international relations, economic development, journalism, political science, communications, graphic designing, marketing or another related field.", "Candidates should be enrolled in a graduate degree program (second university degree, equivalent or higher).", "Must be enrolled in the final year of the academic program (minimum bachelor’s level or equivalent).", "Candidates must have graduated with a recognized university degree as defined above.", "Once a candidate is selected, they must join the internship within one year of graduation."], "benefits": [], "other_details": ["Candidates must have experience in communications and social media outreach.", "Must have experience in online content development.", "Prior experience with the multilateral system will be preferred.", "Candidates must be capable of working in a multicultural environment and know political sensitivities.", "Must be familiar with social media platforms, graphic designing and photo editing software applications.", "The candidates must be good at multitasking and be punctual regarding work submission."], "apply_link": "https://jobs.undp.org/cj_view_job.cfm?cur_job_id=93913"},
{"name": "Chevening OCIS Fellowship 2022", "funding_type": "Fully funded", "deadline": "2021-11-02 00:00:00", "description": "The Chevening OCIS fellowship is open for application. The aim is to promote mid-career academics or professionals who desire to promote academic activities encouraging the culture and civilization of Islam and Muslim societies. The program will begin in October 2022.\nThe fellowship duration is 6 months focusing on research projects on the culture and civilization of Islam. The candidates will develop contacts with a comprehensive group of scholars. The OCIS provides a platform for the western and Islamic world to meet.\nDeadline is November 2, 2021", "region": "United kingdom", "eligibility": ["Applicants must have the potential to rise to a position of leadership.", "Applicants must return to their own country after the completion of the fellowship.", "Must hold a postgraduate degree or equivalent professional training/ experience in the relevant research area (at least 5 years).", "Must hold an English proficiency certificate.", "Applicants must not be British citizens or hold dual-British citizenship.", "If an applicant has received financial aid from HMG before, they are eligible to apply after 5 years following the completion of the HMG financial support. Such applicants must demonstrate their progress after the completion of funding."], "benefits": ["Six months of research opportunity at OCIS.", "Living expenses will be covered during the OCIS fellowship.", "Airfare to and from home country.", "Allowance for research-related activities.", "Access to program cultural events and activities organized by FCDO and Chevening Secretariat."], "other_details": [], "apply_link": "https://www.chevening.org/fellowship/ocis/"},
{"name": "TFAS International Exchange Program 2022", "funding_type": "Fully funded", "deadline": "2021-09-15 00:00:00", "description": "The applications for TFAS international exchange program 2022 are now open. The program is for two weeks to Santiago. It is a fantastic opportunity for the youth to build new networks and develop communication skills. Students will also get to explore the beauty of Santiago.\nThis program is based on economics and democracy education. Students are advised to thoroughly examine the government and economy to have a hand full of knowledge regarding democracy. Students with a better understanding and knowledge of democracy will be preferred for the program. By the end of the program, students will receive 6ECTS credit hours, which is equivalent to 3 U.S. credit hours.\nThis is an excellent opportunity to visit, experience and enjoy a modern city. The students will be permitted to have visits to different places in the city like museums, parks, restaurants etc., to learn about the history and heritage of Chile. This is a golden chance to have a trip along with your studies. This is not it; Chile has also ranked the highest Latin American country on the human development index. It also has one of the top literacy rates in the region.\nThe TFAS international exchange program aims to motivate and enhance the youth for the future. TFAS provides top-class academic facilities and helps the youth create a bond with the leaders. This program will bring students from Asia and the USA together and learn. Students get to discuss and explore principle political issues, government issues, economics, political theory and basics of law and institutional governance. This increases their knowledge not only about Chile but several other countries. Knowledge will be exchanged between the students throughout the course.\nThe TFAS lectures will be a combination of conversations and debates between the students, which will benefit them academically as well as professionally. The lecturers will be conducted by top-class lecturers who will build a network with the students for educational learning. The students will grow and learn during the two weeks of the program.\nThe TFAS international exchange program will commence from 8\n January 2022 and will be for 15 days. So don’t miss the opportunity to have an education trip to Chile. More details regarding the exchange program are given below.\nDeadline is September 15, 2021", "region": "Chile", "eligibility": ["Applicants must be from Latin America or America.", "Applicants must hold an English proficiency certificate.", "Applicants must be active and social.", "Applicants must be interested in political and economic education."], "benefits": ["Students will get an opportunity to explore the beautiful Santiago city.", "This program will help students communicate and make networks with youth.", "Students will get to stay at a four-star hotel for two weeks.", "The exchange program host will cover breakfast and lunch.", "Support for Visa and funding will be provided to the students.", "The exchange program is funded.", "Students will be permitted for outings to discover the history, beauty and heritage of Chile."], "other_details": ["It is an exchange program organized by TFAS.", "The program is for two weeks.", "The program is based on democracy and political education.", "Lectures will be based on conversations and debates."], "apply_link": "https://www.tfasinternational.org/program/santiago/"},
{"name": "RIT Merit-based Scholarships in USA 2022", "funding_type": "Partial Funded", "deadline": "2021-11-01 00:00:00", "description": "RIT merit-based scholarships are open for international students. The competitive scholarship is awarded to brilliant and outstanding students with excellent academic achievements. Students can also be considered for the scholarship based on leadership, entrepreneurship, service, citizenship or creativity. Students will skill like art, design, filming, photography; crafting will be appreciated. RIT merit-based scholarships are offered to pursue undergraduate programs at the Rochester Institute of Technology, it can be renewed for up to eight semesters if students maintain desired academic performance.\nRochester Institute of Technology has a clear mission to improve the world through creativity and innovation. As an engaged, intellectually curious, and socially conscious community, they leverage the power of technology, the arts, and design for the greater good. RIT (Rochester Institute of Technology) was established in 1829 to support creative and innovative minds interested in technology with arts and design. The institute offers various fields of study, including research programs. RIT is widely known for educating dead students. It has a campus in China, Dubai, Kosovo and Croatia with approximately 19,000 students and 13,000 graduates.\nDeadline is November 1, 2021", "region": "USA", "eligibility": ["RIT merit-based scholarships will be awarded to freshmen students who are National Merit Scholar finalists and name RIT as their first-choice choice school for NMSC.", "RIT merit-based scholarships are awarded to freshmen who the College Board recognizes as National Hispanic Recognition Scholars.", "Awarded to outstanding admitted freshman students who, through their essays, reflect an evident enthusiasm for experiential learning.", "The scholarship will be awarded to outstanding admitted freshman applicants who have participated on a high school FIRST team.", "Student’s full-time attendance is necessary to the program of study."], "benefits": ["RIT provides a comprehensive financial support program to support and encourage students. The amount of scholarship depends on the selection based on merit.", "The institute offers other grants, including need-based scholarships and scholarships for transfer students."], "other_details": [], "apply_link": "https://www.rit.edu/admissions/aid/merit-based-scholarships"},
{"name": "Murdoch University Scholarship 2021, Australia", "funding_type": "Fully funded", "deadline": "2021-09-30 00:00:00", "description": "Applications are open for the \n in Australia.\nThe Murdoch University of Perth offers scholarships for the year 2021; both international and domestic students can apply for the scholarship program. The scholarship is for offered to undertake \n. The federal government of Australia hosts this scholarship to bring a positive difference to the country. It is known as the Australian Government Research Training Program (RTP), which is open to all nationalities. Several courses are offered under this scholarship.\nThe Murdoch University is Australia’s well-known public university with campuses in Dubai, Rockingham, Myanmar, and Singapore. It is Perth’s second university that commenced its operations in 1973. The undergraduate programs at Murdoch started in the year 1975. It was named after Sir Walter Murdoch, a well-known English professor and former Chancellor of Western Australia.\nThe Murdoch University appreciates academic as well as extracurricular performance. The students are encouraged to bring a change to the university with their interest in activities. To help brilliant students build their careers, Murdoch University awards scholarships to deserving ones. Murdoch University is currently actively focusing on research work.\nThe university currently has over 23,000 students enrolled; 40% of them are international students from more than 100 countries. Therefore, international students are provided with the best environment to study. Furthermore, with a diverse educational environment, international students will not find it difficult to adjust. Do not miss this golden opportunity to study in Australia and commence a research degree under the supervision of Australian professionals. Apply before the deadline.\nDeadline is September 30, 2021", "region": "Australia", "eligibility": ["Applicant must be holding a first-class Honours degree, H2A (or equivalent) for master’s program,", "Applicant must hold a master’s degree with thesis component for the PhD program,", "International and domestic students are eligible for the scholarship,", "Applicant must hold English proficiency certificate,", "Applicants must not be receiving income from any other source for the support of their academic finances,", "Applicant must meet the English proficiency requirements (English proficiency merit can be found on the official website)."], "benefits": ["No registration fee will be charged,", "The federal government fully funds the program,", "Approximately AUD 30,000 will be awarded for the living allowance per annum (tax-exempted)."], "other_details": ["Master’s program: 2 years", "Doctoral program: 3 years"], "apply_link": "https://www.murdoch.edu.au/study/research-students/fees-scholarships/scholarships/research-training-program-stipend-scholarships"},
{"name": "Tomorrow’s Leaders Graduate Program 2022", "funding_type": "Fully funded", "deadline": "2021-10-01 00:00:00", "description": "The Tomorrow’s Leaders Graduate Program is a joint effort between the U.S. Department of State’s Bureau of Near Eastern Affairs and the American University in Cairo. The program equips academically qualified and deserving students with the professional qualifications and experience required to advance knowledge and contribute to achieving socially relevant outcomes through organized graduate study and research that furthers the professionalization of rising young leaders. It proposes local solutions to shared problems in the MENA region. The program is offered for students from the Middle East and North Africa to obtain a master degree from the American University in one of the following graduate programs:\nApplicants must commit to pursuing their graduate thesis research in one of the mentioned research projects:\nDeadline is October 1, 2021", "region": "Egypt", "eligibility": ["Nationals of the following countries can apply only: Algeria, Iraq, Jordan, Lebanon, Morocco, Tunisia, Yemen, and Syrian citizens residing outside of Syria.", "Meet AUC graduate admission requirements.", "They must have a bachelor’s degree with a minimum overall grade point average of 3.0 on a scale of 4.", "Applicants must be proficient in the English language.", "Possess maturity and leadership potential demonstrated in a combination of extracurricular activities, recommendations, and interviews.", "Financial need."], "benefits": ["Total tuition fees for the fall and spring semesters,", "Medical insurance,", "A monthly stipend,", "Student housing,", "Laptop computer,", "Internship opportunity, including local transportation costs if needed,", "A chance to attend one conference to present research findings applied to and awarded competitively, as per Graduate Student Support Grants guidelines.", "Two annual round-trip economy airfare tickets to campus or housing and a living stipend to continue approved program activities during breaks for students unable to return home because of circumstances beyond their control."], "other_details": ["Applicants must maintain full-time status throughout their graduate studies.", "Applicants are expected to complete their degrees within two years from their date of admission.", "Maintain a minimum GPA of 3.2.", "Commit to the chosen research projects.", "They must complete a minimum of one gender studies graduate-level course.", "Complete a TLG academic English writing course.", "Complete leadership or civic engagement workshops assigned during the program duration.", "Take part in tomorrow’s leaders’ graduate conference."], "apply_link": "https://www.aucegypt.edu/admissions/fellowships/listings/tomorrows-leaders-graduate-program"},
{"name": "OIST Internship in Japan 2022, Fully funded", "funding_type": "Fully funded", "deadline": "2021-10-15 00:00:00", "description": "Opportunities circle is bringing another great opportunity for you, Fully funded OIST Internship in Japan.\nApplications are now open to apply for the fully-funded OIST internship in Japan. The OIST internship in Japan will be held at the Okinawa Institute of Science and Technology (OIST). This internship is fully funded. All costs will be covered including accommodation and travel. The plus point is that IELTS/TOEFL is not mandatory. The duration of the OIST internship will be between 2 and 6 months, usually 10 to 12 weeks. There will be no extension. Students from all over the world are eligible to apply for the internship program in Japan. Enjoy the summer internship program in Japan and experience working under world-class supervisors and contribute to research.\nThis is a paid internship in Japan. The internship in Japan for international students is a great opportunity for students to explore Japan and complete the internship too. You may also discover the door to your future career. Undergraduate and graduate students can apply for the OIST internship in Japan.\nDuration: 2-6 months.\nDeadline is October 15, 2021", "region": "Japan", "eligibility": ["Students enrolled in a postgraduate program in universities, colleges, junior colleges and vocational schools.", "Students enrolled in an undergraduate program at universities, colleges, university colleges and vocational schools in Japan or abroad.", "Recent graduates of such institutions are also eligible to apply.", "Currently, enrolled students must have the approval of their home institution. If you are currently a student, confirm with your institution.", "The students enrolled in the undergraduate program 3rd and 4th year and those of master’s 1 and 2 years are encouraged to apply."], "benefits": ["Round trip tickets", "Visa support", "Accommodation on or off-campus", "Support displacement", "research (stipend) – 2,400 JPY per day (taxable)"], "other_details": ["Curriculum Vitae", "Statement of Interest", "ID Photo", "A letter of Recommendation"], "apply_link": "https://admissions.oist.jp/oist-research-internship-program-description"},
{"name": "Facebook Fellowship Program 2022 (Fully Funded)", "funding_type": "Fully funded", "deadline": "2021-09-20 00:00:00", "description": "The Facebook Fellowship program is offered to support the PhD students and allow them to gain experience and expertise in their field. The applications for Fellowship are open till 20 September. The Facebook Fellowship provides chances for researchers to learn from a globally recognized organization. Students involved in any field of research related to computer science and engineering are encouraged to apply for this program.\nThis Fellowship program will enhance the research skills of the students by incorporating them with a top-class organization. This is a paid program to avail this opportunity without financial burdens during the program. Students with an ongoing research project in the field related to Facebook Fellowship areas will be the main focus of the selection team. The Facebook Fellowship research areas are given in the article below.\nFacebook Fellowship allows doctoral students to continue their programs in their respective institutes. The tuition fee, along with a monthly stipend, will be provided by the Fellowship host. Facebook being an international organization connecting people from around the world, has a diverse organizational environment. Students from underrepresented countries are encouraged to join hands in working with Facebook.\nStudents will also have the golden opportunity to visit the Facebook headquarters in the United States of America while being a part of the Fellowship. This will enhance the creativity, confidence and learning of the students. This program will have a long-term positive impact on the learners.\nThe fellowship program does not limit the selection of students to their academic records. Students in any year of the PhD program have equal chances of being selected. The following article elaborates details of the Fellowship program.\n \nDeadline is September 20, 2021", "region": "USA", "eligibility": ["Applicants must be full-time PhD students enrolled in a recognized institute.", "Applicants can be from any nationality.", "Applicant must be involved in an ongoing research project correlated to one or more of the disciplines of the Facebook Fellowship.", "If an applicant is already receiving any other grant from Facebook, they will automatically be considered ineligible for this Fellowship."], "benefits": ["The Facebook fellowship program will cover tuition fees for the academic years (of up to two years/ four semesters).", "The tuition fee will be submitted directly to the institute of the student", "An annual stipend of US$ 42,000 will be provided for covering the living cost and conference travel cost. The stipend will be given directly to the students.", "Students will get to visit the Facebook headquarters for free", "In order to get these benefits from the Fellowship, applicants must remain enrolled till the completion of the Fellowship."], "other_details": ["A research proposal of a minimum of 500 words", "Two recommendation letters from university professors"], "apply_link": "https://research.fb.com/fellowship/"},
{"name": "Singapore International Graduate Award 2022 SINGA22 (Fully Funded)", "funding_type": "Fully funded", "deadline": "2021-12-01 00:00:00", "description": "Applications are now open for the \nfor August 2022 intake. This scholarship is offered for international students who did not get a chance to study in Singapore before. It is a great opportunity for students who want to pursue PhD abroad. SINGA scholarship will cover all your tuition fees and accommodation. You will be studying in A*STAR Research Institutes, NTU, NUS or SUTD and all the training will be carried out in English.\nThe Singapore International Graduate Award (SINGA) is a collaboration between the Science, Technology and Research Agency (A * STAR), the Nanyang University of Technology (NTU), the National University of Singapore (NUS) and the University of Technology and Design from Singapore. (SUTD). Singapore is the gateway to some of the fastest-growing economies in the Asia Pacific region. And with SINGA, you can get your PhD. Education in Singapore, establish global links and take your research career to greater heights.\nDeadline is December 1, 2021", "region": "Singapore", "eligibility": ["Open for application to all international graduates with a passion for research and excellent academic results.", "Good written and spoken English skills.", "Good reports from academic referees.", "The above eligibility criteria are not exhaustive.", "A * STAR may include additional selection criteria based on current scholarship policies. These policies may be changed from time to time without notice."], "benefits": ["Tuition fees,", "One-time payment allowance of $1,000,", "Single air allowance up to $1,500,", "Monthly stipend of $2,000, which will increase to $ 2,500 after the passing of the Qualification."], "other_details": [], "apply_link": "https://www.a-star.edu.sg/Scholarships/for-graduate-studies/singapore-international-graduate-award-singa"},
{"name": "King’s College London Scholarship 2022", "funding_type": "Fully funded", "deadline": "2021-10-01 00:00:00", "description": " is an excellent opportunity for international students to pursue higher studies in the world’s top research institute. The scholarship is offered for full-time \n. King’s College London provides the students a platform to connect with the world-leading researchers and research projects that help stimulate their academic development. Besides this, King’s College London is a renowned institute when it comes to extracurricular research activities. The students doing their academic research and completing their studies would build self-confidence and leadership skills by taking part in extracurricular activities at King’s College London.\nKing’s PGR Studentships provide support to international students to study in any of King’s Health Faculties or Faculty of Natural and Mathematical Sciences. The postgraduate research scholarship is funded for 4 years, during which the doctoral students can complete their doctoral research degrees (MPhil/PhD). King’s College London Centre for Doctoral studies awarded the fully paid scholarship in London’s best university. Students can apply for life sciences and medicine, psychiatry, psychology, neuroscience, nursing, dentistry, oral and Craniofacial Sciences.\nKing’s College is located in the heart of London and has many attractions for students across the world. The modern and safest lifestyle is undoubtedly one of the most significant reasons why applicants should apply for higher studies scholarships. The King’s is one of the UK’s oldest universities and a leading public research university. Moreover, the institute is Europe’s largest centre for graduate and postgraduate medical teaching and biomedical research by its students. The institute has the world’s first nursing institute, i.e Florence Nightingale Faculty of Nursing and Midwifery. By becoming a part of the institute, scholars will get an opportunity to gain experience that will help them grow in the future with self-motivation and confidence.\nDeadline is October 1, 2021", "region": "United kingdom", "eligibility": ["Applicants must be applying for a full-time MPhil/PhD program.", "Applicants’ MPhil or PhD must start from June 2022.", "Applicants should have an offer of admission to King’s College London’s respective program by January 31 2022.", "Applicants must be international students and shall not receive any other scholarship.", "Applicants must not have commenced their doctoral study at King’s College London already.", "Applicants who want to pursue professional doctorate degrees including MD (Res) and DC linPsy are ineligible.", "Joint PhD programs are not offered."], "benefits": ["The total tuition fee will be covered.", "The applicants will be provided with an annual stipend of £ 17,609.", "The applicants will be given research costs of up to £500 per annum, depending on the research projects."], "other_details": ["Research Proposal of the applicant", "Academic excellence", "Statement of Justification"], "apply_link": "https://www.kcl.ac.uk/study/funding/pgr-international-studentships"},
{"name": "Melbourne International Scholarship 2022, Australia", "funding_type": "Partial Funded", "deadline": "2021-11-30 00:00:00", "description": "Melbourne International Scholarship is awarded to those who have excellent academic results. The scholarships are offered for international students to pursue undergraduate studies at Melbourne University. The University of Melbourne international scholarship welcomes students from all countries except New Zealand and Australia; to continue their higher studies without worrying about finance and expenses. The students are honored by this award based on their previous academic achievements. The University of Melbourne provides a platform for international students who have a great passion for pursuing higher studies in one of the world’s leading universities. The university has prominence in high achievements in every field.\nMoreover, Melbourne University engages its staff and students to think big and empowers them to talk about sustainability issues confidently with knowledge. The Melbourne international undergraduate scholarship allows the students to experience world-class learning under experts in the related fields. Moreover, the scholarship is applicable for all fields offered at Melbourne University. Finally, the scholarship aims to support international students who demonstrate academic excellence to encourage them.\nThe University of Melbourne is one of the best and safest places to study. The University of Melbourne has developed a plan that allows the students, staff, and researchers to make valuable contributions to this challenging world. It is an excellent chance for talented students to participate in all these progressive strategies and implement them in their real lives.\nDeadline is November 30, 2021", "region": "Australia", "eligibility": ["Applicants must be international students", "Citizens of Australia or New Zealand", "are not eligible.", "Applicants must receive an offer letter from the University of Melbourne.", "The applicant must have received top high secondary school grades or equivalent that place the applicant in the top 3%, such as:", "3A* in A-levels (At least 93%)", "In Australian Foundation studies, at least 98%.", "In International Baccalaureate, at least score 42.", "Minimum GPA 3.9 and SAT of at least 1500 and an ACT of at least 31 (according to the US high school system).", "According to Canadian Secondary School, an overall score of 97% is required.", "According to India Secondary School, an overall score of at least 95%.", "According to the Vietnamese High School system, an overall score of at least 90% is required.", "Applicants must not have undertaken any previous tertiary studies."], "benefits": ["The scholarship provides a $10,000 tuition fee for the first year of an undergraduate program.", "Fifty per cent fee remission for the next three years will be done under the scholarship.", "One hundred per cent fee remission for the next three years can be done if students maintain academic excellence and meet the university’s requirements."], "other_details": [], "apply_link": "https://scholarships.unimelb.edu.au/awards/melbourne-international-undergraduate-scholarship"},
{"name": "Cyprus Science University Scholarship 2021", "funding_type": "Partial Funded", "deadline": "2021-08-31 00:00:00", "description": "International students can apply for the \n. The institute is offering scholarships for international students to pursue undergraduate or postgraduate degree programs. The university provides many ways to get financial help in your studies. This time Cyprus Science University is offering partially funded scholarships to support international students to help them with financial burden and promote education. The scholarship award will depend on student’s SAT scores and the program they are enrolled for. All the international undergraduate students are entitled to receive up to 60% scholarship for undergraduate courses, and Postgraduate international students will receive up to 50% scholarship.\nCyprus Science University is accredited by higher education authorities of Northern Cyprus and Turkey. It is an excellent chance to study in a European country next to Turkey. Read the following article and start preparing for your scholarship.", "region": "Cyprus", "eligibility": ["Students must submit SAT scores to Cyprus Science University for a merit scholarship.", "Students must have studied for at least one semester in their respective departments.", "Students who are studying in English preparatory schools are ineligible for this scholarship.", "Students must have a minimum of 2.0 CGPA to be considered for the transfer scholarship.", "Students of the need-based scholarship must submit a letter to the university’s rectorate requesting financial aid.", "Need-based scholarship students must submit all their required documents along with the letter. The final decision will be of the rector whether to award the scholarship to the student or not.", "International students who bring their siblings to Cyprus University for admission will gain an extra scholarship for their siblings. It means their siblings will get up to 75% scholarship.", "To be considered for the student assistantship, one must have a GPA above 3.0."], "benefits": ["Cyprus Science University provides 75%, 80% and 100% scholarships depending on SAT score.", "Scholarships are applicable on tuition fees only; students must pay their social activity fees and VAT.", "Most international students receive 60% scholarship for undergraduate programs and 50% for graduate programs at the Cyprus Science University."], "other_details": ["Copy of high school diploma", "Copy of official transcript in English", "SAT score 1200 to receive 75% scholarship", "SAT score 1300 to receive 80% scholarship", "1400 and above score will provide a 100% scholarship", "English language requirements (IELTS 6.0 or TOEFL score 75)", "If the applicants do not have IELTS or TOEFL, they can take an English proficiency test.", "Transcripts", "Undergraduate degree", "Two reference letters", "Letter of intent", "*All documents must be submitted in English*"], "apply_link": "https://international.csu.edu.tr/scholarship/"}
]